[
  {
    "source": "SVT Nyheter",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "Nytt bakslag för LKAB:s monsterbygge i Malmberget",
        "link": "https://www.svt.se/nyheter/lokalt/norrbotten/nytt-bakslag-for-lkabs-monsterbygge-i-malmberget",
        "timestamp": "2025-10-15T16:38:26.719389",
        "published": "2025-10-15T14:26:28",
        "summary": "Allt är krattat och förberett på LKAB:s industriområde i Malmberget. Men det stora Hybritprojektet har stött på ett nytt bakslag: Domstolen har valt av avbryta miljöförhandlingen och därmed skjuts domen upp."
      },
      {
        "title": "Miljonnotan efter Anna-Karin Hatt – kan få historiskt avgångsersättning",
        "link": "https://www.svt.se/nyheter/inrikes/miljonnotan-efter-anna-karin-hatt-kan-fa-historiskt-avgangsersattning",
        "timestamp": "2025-10-15T16:38:26.719389",
        "published": "2025-10-15T14:23:30",
        "summary": "Anna-Karin Hatt fick en rekordlön när hon tog sig an rollen som partiledare för Centerpartiet och blev Sveriges bäst betalda partiledare. Nu kan hon få ett historiskt stort avgångsersättning som kan kosta Centerpartiet över 2,6 miljoner kronor."
      },
      {
        "title": "Motion till riksdagen: Gör en kursplan i teckenspråk som modersmål",
        "link": "https://www.svt.se/nyheter/inrikes/motion-till-riksdagen-gor-en-kursplan-i-teckensprak-som-modersmal",
        "timestamp": "2025-10-15T16:38:26.719389",
        "published": "2025-10-15T14:18:03",
        "summary": "Javascript är avstängt Javascript måste vara påslaget för att kunna spela video Läs mer om webbläsarstöd Se Jessica Rodén (S) berätta mer om sin motion i videon ovan. Foto: Kristoffer Kold Erlandsen Motion till riksdagen: Gör en kursplan i teckenspråk som modersmål Publicerad idag 16:18 Det finns ingen kursplan för teckenspråk som modersmål. Det tycker riksdagsledamot Jessica Rodén (S) är dåligt och har därför lämnat in en motion om att Skolverket ska ta fram en kursplan. I början på oktober lämnade Jessica Rodén (S) in en motion om att Skolverket ska ta fram en nationell kursplan i teckenspråk. Detta efter att Örebro kommun nyligen tagit bort sin modersmålsundervisning på teckenspråk. – Jag har fått positiv respons att man tycker det här är viktigt att modersmålsundervisningen ska vara en tillgång och en rättighet, säger Jessica Rodén (S). Modersmålsundervisning – teckenspråk Örebro kommun återupptar teckenspråksundervisning Örebro kommun gör en vändning – återupptar modersmålsundervisning Men i Örebro har man alltså tagit bort modersmålsundervisningen på teckenspråk. – Vi har bedrivit teckenspråk som modersmål och satt betyg, men det är inte förenligt med de styrdokument som finns inom skolplan, läroplan och kursplan. Så därför har vi fattat beslut om att ta bort det, säger Katarina Arkehag, förvaltningschef för förskola och grundskola i Örebro kommun. I en skriftlig fråga i riksdagen svarade Lotta Edholm (L) att hon ser det som en viktig fråga och öppnar upp för ”åtgärd”. Hon säger dock även att kommunerna skulle kunna använda samma kursplan som för undervisning i teckenspråk för hörande. Det är ett förslag som Jessica Rodén (S) inte ger mycket för och hänvisar till forskningen. – Jag förlitar mig på de olika utredningar som menar att man inte alls kan applicera den läroplanen på språk som inte grundar sig på ljud och tal, säger hon. Nuvarande utbildningsministern Simona Mohamsson (L) har avböjt en intervju med motiveringen att hon inte är tillräckligt insatt. Mo..."
      },
      {
        "title": "Mia Frisk om Anna-Karin Hatts avgång – vill se ändring i debatten",
        "link": "https://www.svt.se/nyheter/lokalt/jonkoping/mia-frisk-om-anna-karin-hatts-avgang-vill-se-andring-i-debatten",
        "timestamp": "2025-10-15T16:38:27.052152",
        "published": "2025-10-15T14:07:50",
        "summary": "Före detta regionpolitikern Mia Frisk som själv utsatts för hot och hat som politiker tror att Anna-Karin Hatts avgång kan bli en väckarklocka. – Jag hoppas att Anna-Karins besked idag kan göra att vi får en förändring, säger Mia Frisk."
      },
      {
        "title": "Förslaget: Slut på rökdykning på landsbygden: ”Svårt att förstå”",
        "link": "https://www.svt.se/nyheter/lokalt/ost/forslaget-slut-pa-rokdykning-pa-landsbygden-svart-att-forsta",
        "timestamp": "2025-10-15T16:38:27.052152",
        "published": "2025-10-15T13:42:47",
        "summary": "Ett förslag från Räddningstjänsten Östra Götaland kan innebära att rökdykningsförmågan vid brandstationerna Bestorp, Ulrika och Östra Husby ska avvecklas – något som deltidsbrandmännen är starkt kritiska mot."
      },
      {
        "title": "Grovt kriminell fritogs från förvaret i Ljungbyhed",
        "link": "https://www.svt.se/nyheter/lokalt/helsingborg/grovt-kriminell-fritogs-fran-forvaret-i-ljungbyhed",
        "timestamp": "2025-10-15T16:38:27.052152",
        "published": "2025-10-15T13:40:42",
        "summary": "En av de fyra personer som fritogs från förvaret i Ljungbyhed har en grovt kriminell bakgrund och har dömts för flera brott. – Det här ska inte kunna hända egentligen, säger polisens förundersökningsledare Martin Östling."
      },
      {
        "title": "Osby-Centern om partiledarens avgång: ”Chockad”",
        "link": "https://www.svt.se/nyheter/lokalt/skane/osby-centern-om-partiledarens-avgang-chockad",
        "timestamp": "2025-10-15T16:38:27.052152",
        "published": "2025-10-15T13:36:28",
        "summary": "Javascript är avstängt Javascript måste vara påslaget för att kunna spela video Läs mer om webbläsarstöd Lotte Melin (C), kommunstyrelsens ordförande i Osby, har varit väldigt nöjd med Anna-Karin Hatts ledarskap. Foto: John Riggebo/SVT, SVT arkiv Osby-Centern om partiledarens avgång: ”Chockad” Uppdaterad idag 15:39 Publicerad idag 15:36 Lotte Melin (C), kommunstyrelsens ordförande i Osby, sörjer Anna-Karin Hatts (C) beslut att lämna politiken. Hon känner igen det som partiledaren lämnar över: hot och hat mot folkvalda. – Men inte alls i den nivå som hon har blivit utsatt för, säger Lotte Melin. Hon har känt sig trygg med Hatt vid Centerpartiets roder, en roll som partiledaren axlade i april. – Jag hade de senaste dagarna pratat mycket med andra centerpartister, om hur bra det kändes med Anna-Karin, säger Lotte Melin. Centerpartiet byter partiledare 2025 C i Värmland efter Hatts avgång: Chock och förvåning Anna-Karin Hatt vald som ny ordförande för Centerpartiet Vad betyder det här för Centerpartiet? – Det är för tidigt att säga. Men vi behöver kavla upp ärmarna och hjälpas åt att reda ut det här. Det måste bli en debatt runt det här med hat och hot, säger hon. Hör mer om Lotte Melins reaktion i klippet ovan. Centerpartiet byter partiledare 2025 Anna-Karin Hatt Centerpartiet Politik Osby Relaterat 2 min Anna-Karin Hatt avgår som partiledare för Centerpartiet Idag 10:00 1 min Marmorstein: ”Väldigt överraskande” att Anna-Karin Hatt avgår Idag 11:34 42 sek ”Det är för jävligt” – kommunalrådet i Jönköping reagerar på Anna-Karin Hatts avgång Idag 11:12 2 min Chock i Centerpartiet efter Anna-Karin Hatts besked: ”Folk är förbannade” Idag 12:01 31 sek Anna-Karin Hatts (C) avgår – partiledare reagerar: ”Mörk dag” Idag 10:53 Så arbetar vi SVT:s nyheter ska stå för saklighet och opartiskhet. Det vi publicerar ska vara sant och relevant. Vid akuta nyhetslägen kan det vara svårt att få alla fakta bekräftade, då ska vi berätta vad vi vet – och inte vet. Läs mer om hur vi arbetar. ..."
      },
      {
        "title": "Kim Källström: ”Allt har inte varit dåligt”",
        "link": "https://www.svt.se/sport/fotboll/kim-kallstrom-allt-har-inte-varit-daligt",
        "timestamp": "2025-10-15T16:38:27.162331",
        "published": "2025-10-15T13:21:27",
        "summary": "Javascript är avstängt Javascript måste vara påslaget för att kunna spela video Läs mer om webbläsarstöd Kim Källström om lärdomarna efter ”JDT”: ”Det håller jag nog på ett litet tag” Foto: Emma Wallskog / BILDBYRÅN Kim Källström: ”Allt har inte varit dåligt” Uppdaterad idag 15:28 Publicerad idag 15:21 Han gav Jon Dahl Tomasson avskedsbeskedet. Nu uttalar sig fotbollschef Kim Källström om beslutet. – Allt har inte varit dåligt, säger han. Se Kim Källström svara på om de kommer resonera annorlunda i rekryteringen av nästa förbundskapten. Det har gått ett dygn sedan Svenska fotbollförbundet valde att sparka förbundskapten Jon Dahl Tomasson. – Det är bara baserat på resultaten, förklarar fotbollschef Kim Källström vid trupputtagningen till Nations League för damlandslaget. Herrlandslaget i fotboll Camp Sweden efter avskedet av JDT: ”Nytändning” SvFF:s ordförande efter beslutet att sparka JDT: ”Har en bruttolista” Jakten på Dahl Tomassons efterträdare är i gång. Källström berättar att det pågår ett intensivt arbete. – Vi vet att vi har en kort tidslinje innan vi ska presentera herrarnas nästa trupp. Vårt mål är att hitta den bäst lämpade personen för att leda vårt herrlandslag, säger Källström. Hur mycket sanning ligger det i namnen det spekuleras i? Graham Potter, Ole Gunnar Solskjaer, Jimmy Thelin? – Vi är en inne i en period när det kommer att spekuleras om väldigt många namn. Det här är en fråga som engagerar väldigt många. Sverige ska närmast spela mot Schweiz den 15 november i VM-kvalet. Javascript är avstängt Javascript måste vara påslaget för att kunna spela video Läs mer om webbläsarstöd JDT:s kvalfacit – sämst av alla svenska förbundskaptener någonsin Foto: Christine Olsson/TT Herrlandslaget i fotboll Kval till fotbolls-VM 2026 Jon Dahl Tomasson Fotboll Relaterat 1 min Graham Potter öppnar för att ta över Sveriges landslag Igår 16:58 1 min SvFF:s ordförande efter beslutet att sparka JDT: ”Har en bruttolista” Igår 17:29 1 min Mikael Lustig efter beskedet om Jon..."
      },
      {
        "title": "Undersköterska döms för våldtäktsförsök på dement patient",
        "link": "https://www.svt.se/nyheter/lokalt/halland/underskoterska-doms-for-valdtaktsforsok-pa-dement-patient",
        "timestamp": "2025-10-15T16:38:27.382822",
        "published": "2025-10-15T12:57:51",
        "summary": "Undersköterska döms för våldtäktsförsök på dement patient Uppdaterad idag 15:58 Publicerad idag 14:57 Vårdaren ska ha försökt få brukaren att utföra oralsex. Nu döms mannen, vid Varberg tingsrätt, till tre års fängelse. Händelsen inträffade förra hösten på ett boende i Varberg. Mannen i 50-årsåldern döms för försök till grov våldtäkt eftersom rätten menar att han visat särskild hänsynslöshet. Enligt domen har offret på grund av sin sjukdom befunnit sig i en särskild utsatt position i sin beroendeställning till gärningsmannen. Vittne grep in Rättens bedömning är också att våldtäkten skulle fullbordats om det inte vore för att ett vittne avbröt gärningsmannen. Han döms även för grovt sexuellt övergrepp mot en person som var inlagd på en psykiatrisk avdelning. Bland annat ska han rört personens underliv. I domen framkommer det även att mannen varit misstänkt för sexuella ofredanden på avdelningen vid två andra tillfällen. Mannen förnekar brott i båda fallen han döms för. Han menar att vittnet misstolkat situationen i fallet med den dementa patienten. Varberg Så arbetar vi SVT:s nyheter ska stå för saklighet och opartiskhet. Det vi publicerar ska vara sant och relevant. Vid akuta nyhetslägen kan det vara svårt att få alla fakta bekräftade, då ska vi berätta vad vi vet – och inte vet. Läs mer om hur vi arbetar."
      },
      {
        "title": "Förlossningen blev en ögonöppnare – forskaren insåg hur tuff pappans roll är",
        "link": "https://www.svt.se/nyheter/uutiset/svenska/forlossningen-blev-en-ogonoppnare-forskaren-insag-hur-tuff-pappans-roll-ar",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T12:22:08",
        "summary": "Många pappor har inte processat sina känslor eller upplevelser kring förlossningen, i alla fall inte med andra än sin partner. Finländska doktoranden Tuuli Paajanen har intervjuat över 20 pappor och undersöker hur förlossningen upplevs av den som står bredvid. – Jag tror att många pappor funderar mycket på: kan man prata om det här? och får man ens prata om det här?, säger Paajanen."
      },
      {
        "title": "Förlossningen är inte bara mammans upplevelse – nu talar papporna ut",
        "link": "https://www.svt.se/nyheter/uutiset/svenska/forlossningen-ar-inte-bara-mammans-upplevelse-nu-talar-papporna-ut",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T12:20:42",
        "summary": "Samuel och Santeri var med vid sina barns födslar. Båda berättar om starka känslor och tankar som väcktes under förlossningen. Ändå talas det sällan om hur pappor upplever en förlossning. – Det händer så mycket under en förlossning, och du blir pappa, säger Santeri."
      },
      {
        "title": "Asllani och Sembrant med i truppen mot Spanien",
        "link": "https://www.svt.se/sport/fotboll/asllani-och-sembrant-med-i-truppen-mot-spanien",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T12:15:11",
        "summary": "Kosovare Asllanis framtid i landslaget har tidigare varit oviss. Men när truppen som ska möta Spanien i Nations League togs ut, fanns mittfältaren med. – Otroligt glad att hon ville vara med på den här Nations League-resan, säger förbundskapten Tony Gustavsson."
      },
      {
        "title": "C-toppen Emma Wiesner utesluter inte att bli ny partiledare",
        "link": "https://www.svt.se/nyheter/inrikes/c-toppen-emma-wiesner-utesluter-inte-att-bli-ny-partiledare",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T11:22:20",
        "summary": "C-toppen Emma Wiesner håller dörren öppen för att bli partiledare efter Anna-Karin Hatt, uppger hon för SVT. – Det finns anledning att återkomma i frågan, säger hon. Samtidigt pekar flera centrala personer ut ett annat namn som storfavorit att ta över."
      },
      {
        "title": "Sam Hallams pik till fotbollen: ”Populistisk vinkel”",
        "link": "https://www.svt.se/sport/fotboll/sam-hallams-pik-till-fotbollen-populistisk-vinkel",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T11:17:07",
        "summary": "Svenska Fotbollförbundet valde Jon Dahl Tomasson som efterträdare till Janne Andersson med löfte om en mer offensiv fotboll. Förbundskaptenskollegan inom ishockeyn, Sam Hallam, ger sin syn på det vägval som nu havererat. – Jag själv identifierar mig mycket mer med Janne än den populistiska vinkel som fotbollsförbundet valde, säger han till SVT Sport."
      },
      {
        "title": "Paret lämnade tryggheten för 365 dagar i Jokkmokks vildmark",
        "link": "https://www.svt.se/nyheter/lokalt/norrbotten/paret-lamnade-tryggheten-for-365-dagar-i-jokkmokks-vildmark",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T10:45:09",
        "summary": "Paret Annelie och Sven-Ingvar Blind har tidigare upplevt årstiderna i Staloluokta. Nu tar de fascinationen ett steg längre och flyttar in i Padjelanta nationalpark – ett helt år. – Fjället är stort. Jag får väl gå ut om jag blir less på honom, säger Annelie med ett skratt."
      },
      {
        "title": "Besättningsman som föll överbord utanför Skelleftehamn har hittats avliden",
        "link": "https://www.svt.se/nyheter/lokalt/vasterbotten/besattningsman-som-foll-overbord-utanfor-skelleftehamn-har-hittats-avliden",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T10:43:35",
        "summary": "En besättningsman föll omkring 20 meter ner i havet från ett handelsfartyg utanför Skelleftehamn under tisdagsmorgonen. Nu har mannen hittats avliden. – Han hittades i vattnet i samband med dykning, säger Marie Andersson, presstalesperson på polisen."
      },
      {
        "title": "Chock i Centerpartiet efter Anna-Karin Hatts besked: ”Folk är förbannade”",
        "link": "https://www.svt.se/nyheter/inrikes/chock-i-centerpartiet-efter-anna-karin-hatts-besked-folk-ar-forbannade",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T10:01:14",
        "summary": "C-ledaren Anna-Karin Hatts plötsliga avgångsbesked möts av stor chock och ilska i partiet, enligt källor till SVT. Enligt C-toppen Alireza Akhondi kommer beskedet mycket olägligt för partiet. – Det här var inte alls vad vi behövde inför valrörelsen."
      },
      {
        "title": "Marmorstein: ”Väldigt överraskande” att Anna-Karin Hatt avgår",
        "link": "https://www.svt.se/nyheter/inrikes/marmorstein-valdigt-overraskande-att-anna-karin-hatt-avgar",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T09:34:48",
        "summary": "Med mindre än ett år till riksdagsvalet kom beskedet att Centerledaren Anna-Karin Hatt avgår. – Det är problematiskt för Centerpartiet att de tappar sin partiledare, säger Elisabeth Marmorstein, inrikespolitisk kommentator på SVT."
      },
      {
        "title": "”Det är för jävligt” – kommunalrådet i Jönköping reagerar på Anna-Karin Hatts avgång",
        "link": "https://www.svt.se/nyheter/lokalt/jonkoping/det-ar-for-javligt-kommunalradet-i-jonkoping-reagerar-pa-anna-karin-hatts-avgang",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T09:12:47",
        "summary": "Kommunalrådet Rikard Bunnvik (C) i Jönköping reagerar med bestörtning över Anna-Karin Hatts plötsliga avgång som partiledare. Hon avgår på grund av hat och hot som hon har mottagit under sin korta tid som partiledare."
      },
      {
        "title": "Flera åtalas för mord i gångtunnel i Geneta",
        "link": "https://www.svt.se/nyheter/lokalt/sodertalje/flera-atalas-for-mord-i-gangtunnel-i-geneta",
        "timestamp": "2025-10-15T16:38:28.001343",
        "published": "2025-10-15T09:07:25",
        "summary": "En ung man sköts till döds i mars i år, i en gångtunnel i Geneta, Södertälje. Nu har åtal väckts mot tre personer för inblandning i mordet. – Mordet har föregåtts av planering med flera inblandade, säger kammaråklagare Markus Hankkio."
      }
    ],
    "scraped_count": 20,
    "format": "rss",
    "feed_title": "SVT Nyheter"
  },
  {
    "source": "Dagens Nyheter",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "”Adolescence”-pappan startar bokprojekt: ”Skriv till din son”",
        "link": "https://www.dn.se/kultur/adolescence-pappan-startar-bokprojekt-skriv-till-din-son/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T14:08:37",
        "summary": "Skådespelaren Stephen Graham fick ett stort genombrott med sin roll i Netflixserien ”Adolescence”. Nu tar han pappaproblematiken i tv-serien vidare i ett globalt projekt där pappor uppmanas skriva brev till sina söner."
      },
      {
        "title": "Insändare. Hat och hot mot politiker hotar den svenska demokratin",
        "link": "https://www.dn.se/insandare/hat-och-hot-mot-politiker-hotar-den-svenska-demokratin/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T13:33:28",
        "summary": "INSÄNDARE. Anna-Karin Hatts avhopp som C-ledare är extra allvarligt eftersom hon stod upp emot hårda ord i politiska debatter. Det är sådana förebilder vi behöver fler av, skriver Maria Borgehammar, politisk sekreterare för Kristdemokraterna i Region Västernorrland."
      },
      {
        "title": "Kosovare Asllani fortsätter i landslaget: ”Jag blev oerhört glad”",
        "link": "https://www.dn.se/sport/asllani-med-i-gustavssons-forsta-trupp-blev-otroligt-glad/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T13:32:42",
        "summary": "Hungern efter en titel är stor. Så stor att veteranerna Kosovare Asllani och Linda Sembrant fortsätter i landslaget, som närmast möter världsmästaren Spanien i semifinal i Nations League. – Jag vet att de precis som jag älskar att tävla, säger fotbollsdamerna nye förbundskapten Tony Gustavsson."
      },
      {
        "title": "Vem vågar ta över efter Hatt?",
        "link": "https://www.dn.se/sverige/vem-vagar-ta-over-efter-hatt/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T13:06:13",
        "summary": "Anna-Karin Hatts tid som Centerledare blev kort. Nu måste partiet hitta en efterträdare som är beredd att kliva in i hetluften redan på stämman i november. Blir det en populär partiveteran, en EU-parlamentariker eller en riksdagsledamot? Här är namnen som nämns internt."
      },
      {
        "title": "Intet nytt på Västbanken trots Trumps triumf",
        "link": "https://www.dn.se/varlden/intet-nytt-pa-vastbanken-trots-trumps-triumf/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T13:04:43",
        "summary": "BETLEHEM. Trumps fredsplan imponerar ännu inte på invånarna på Västbanken. För dem är livet som vanligt, med begränsad rörelsefrihet och gränskontroller. – Om det ska bli riktig fred måste vi få tillbaka vår frihet, säger palestiniern Issa Shatleh och blickar genom ett galler för att få en glimt av sitt olivträd."
      },
      {
        "title": "Expert om hat och hot mot politiker: ”Frågan är om någon orkar med i längden”",
        "link": "https://www.dn.se/sverige/expert-om-hat-och-hot-mot-politiker-fragan-ar-om-nagon-orkar-med-i-langden/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T12:57:51",
        "summary": "Nästan var tredje politiker upplevde hot och trakasserier under valåret 2022. MP och SD är värst drabbade, men C sticker ut vad gäller upprepad utsatthet. – Frågan är om någon orkar med det här i längden, säger Ulf Petäjä, lektor i statsvetenskap vid Högskolan i Halmstad."
      },
      {
        "title": "Paulina Sokolow: Israel tar ut sitt fiasko på Greta Thunberg",
        "link": "https://www.dn.se/kultur/paulina-sokolow-israel-tar-ut-sitt-fiasko-pa-greta-thunberg/",
        "timestamp": "2025-10-15T16:38:26.465591",
        "published": "2025-10-15T12:56:05",
        "summary": "En utskrift från Dagens Nyheter, 2025-10-15 16:37 Artikelns ursprungsadress: https://www.dn.se/kultur/paulina-sokolow-israel-tar-ut-sitt-fiasko-pa-greta-thunberg/ Tortyr, förnedring och förbundna ögon. De övergrepp från israelisk militär som Greta Thunberg vittnar om i Aftonbladet borde utlösa ett diplomatiskt ramaskri från Sverige, skriver Paulina Sokolow. Detta är en opinionstext i Dagens Nyheter. Skribenten svarar för åsikter i artikeln. Spara Sparad Dela Få ut mer av DN som inloggad Du vet väl att du kan skapa ett gratiskonto på DN? Som inloggad kan du ta del av flera smarta funktioner. Följ dina intressen Nyhetsbrev Logga in Skapa konto gratis ”Vi har vunnit.” Så skrev opinionsbildaren Amit Segal i dagstidningen Israel Hayom , ord som den israeliska regeringen i två år drömt om att få uttala. Med fredsuppgörelsen mellan Hamas och Israel kom äntligen läget att utropa seger. Själv har jag svårt att fira. Av de 251 gisslan som togs den 7 oktober har 160 kommit hem levande. Resten är döda. Flera bedömare menar att en räddningsaktion hade kunnat utföras betydligt tidigare och räddat fler liv. Att kalla det för en seger framstår som ett hån för de anhöriga till de döda, många vars kroppar är så tilltygade att de kanske inte ens går att samla ihop inför en begravning och en normal sorgeprocess. Har Israel utplånat Hamas, som varit den övergripande målsättningen och alltså värt offrade judiska liv? Troligen inte. Som USA:s tidigare utrikesminister Anthony Blinken konstaterade: ”Hamas har rekryterat nästan lika många nya soldater som de har förlorat.” Det sägs också att alla de rester och fragment av bomber och annan krigsteknologi som fällts över Gaza samlats ihop för återbruk för nya attacker. Inte mycket till triumf. Desto viktigare var det för regeringen Netanyahu att hålla god min och feststämningen uppe inför Donald Trumps besök. Detta är tortyr – ett övergrepp som borde ha utlöst ramskri hos den svenska ambassadpersonalen och en diplomatisk kris mellan länderna S..."
      },
      {
        "title": "Ledare: I dag tog hatet makten över politiken",
        "link": "https://www.dn.se/ledare/i-dag-tog-hatet-makten-over-politiken/",
        "timestamp": "2025-10-15T16:38:26.719389",
        "published": "2025-10-15T12:33:54",
        "summary": "En utskrift från Dagens Nyheter, 2025-10-15 16:37 Artikelns ursprungsadress: https://www.dn.se/ledare/i-dag-tog-hatet-makten-over-politiken/ I dag är många politiker chockade och menar att hatet inte får vinna. Det är fina ord. Men vad betyder de i praktiken? Detta är en huvudledare skriven av medarbetare på Dagens Nyheters ledarredaktion. DN:s politiska hållning är oberoende liberal. Text DN:s ledarredaktion Spara Sparad Dela Få ut mer av DN som inloggad Du vet väl att du kan skapa ett gratiskonto på DN? Som inloggad kan du ta del av flera smarta funktioner. Följ dina intressen Nyhetsbrev Logga in Skapa konto gratis Den 15 oktober tog hatet makten över svensk politik. Då meddelade Centerledaren Anna-Karin Hatt, med brusten stämma, att hennes tid som partiledare blir kortare än hon hade trott. Den hastiga avgången handlar inte om förtroendesiffror eller resultat i opinionsmätningarna. Utan om något mycket värre: Den råa tonen i samhällsdebatten, där hat och hot mot folkvalda tillhör vardagen. Under pressträffen, där Hatt meddelade sitt beslut, förklarade hon att hon inte känner sig trygg ens hemmavid. Och det är inte undra på. Centerns tidigare partiledare Annie Lööf var inte bara en av måltavlorna för mordet i Almedalen 2022. Tidigare hade nazister dukat upp en ”sista måltid” på hennes uppfart, filmat och lagt ut på nätet. Och efter det senaste riksdagsvalet förklarade hon att hon var lättad över att inte ha kommit till skada under valrörelsen – varpå hon avgick. En annan som fått hembesök är utrikesminister Maria Malmer Stenergard (M). En annan som fått hembesök är utrikesminister Maria Malmer Stenergard (M) . I somras tog sig aktivister in i hennes trappuppgång, satte upp affischer och publicerade inlägg i sociala medier. Hon har dessutom fått tomater och lök kastade mot sig under en riksdagsdebatt. Civilförsvarsminister Carl-Oskar Bohlin (M) har tvingats stå ut med att propalestinska demonstranter följt efter honom på ett djupt obehagligt sätt. Vice statsministe..."
      },
      {
        "title": "Skolor i Lindesberg inrymdes efter larm",
        "link": "https://www.dn.se/sverige/skolor-i-lindesberg-inrymda-efter-larm/",
        "timestamp": "2025-10-15T16:38:27.209444",
        "published": "2025-10-15T12:23:28",
        "summary": "En utskrift från Dagens Nyheter, 2025-10-15 16:38 Artikelns ursprungsadress: https://www.dn.se/sverige/skolor-i-lindesberg-inrymda-efter-larm/ Två skolor i Lindesberg inrymdes och polisen drog i gång en stor insats efter ett larm om en person ”med avvikande beteende”. Efter ungefär en timme började eleverna släppas ut. Är du redan prenumerant, logga in för att fortsätta läsa. Logga in Läs DN +Allt 2 månader för 9 kr Därefter ord. pris 249 kr/mån. DN.se, Expressen.se, lokala nyhetssajter och mer ingår. Det här ingår i DN +Allt Alla artiklar på DN.se och i DN-appen Obegränsad tillgång till Expressen.se och all livesport Över 50 lokala nyhetssajter – från Sydsvenskan i söder till Östersunds-Posten i norr Ekonomi- och börsnyheter online med Privata Affärer och Marknadsnytt – en del av Dagens industri Magasinappen Arcy med över 100 magasin digitalt Dessutom alla artiklar på amelia.se, teknikensvarld.se, mama.se, skonahem.se, alltomresor.se, levaochbo.se, alltommat.se och halsoliv.se Samma inlogg överallt Ett extra konto – bjud in en familjemedlem Läs DN +Allt 2 månader för 9 kr Ditt erbjudande DN +Allt Därefter ord. pris 249 kr/mån. DN.se, Expressen.se, lokala nyhetssajter och mer ingår. Det här ingår Alla artiklar på DN.se och i DN-appen Obegränsad tillgång till Expressen.se och all livesport Över 50 lokala nyhetssajter – från Sydsvenskan i söder till Östersunds-Posten i norr Ekonomi- och börsnyheter online med Privata Affärer och Marknadsnytt – en del av Dagens industri Magasinappen Arcy med över 100 magasin digitalt Dessutom alla artiklar på amelia.se, teknikensvarld.se, mama.se, skonahem.se, alltomresor.se, levaochbo.se, alltommat.se och halsoliv.se Samma inlogg överallt Ett extra konto – bjud in en familjemedlem"
      },
      {
        "title": "DN Debatt Repliker. ”Timbro har förlorat sin största styrka – ideologin”",
        "link": "https://www.dn.se/debatt/timbro-har-forlorat-sin-storsta-styrka-ideologin/",
        "timestamp": "2025-10-15T16:38:27.842930",
        "published": "2025-10-15T12:17:21",
        "summary": "En utskrift från Dagens Nyheter, 2025-10-15 16:37 Artikelns ursprungsadress: https://www.dn.se/debatt/timbro-har-forlorat-sin-storsta-styrka-ideologin/ DN DEBATT SLUTREPLIK: Två tidigare medarbetare på tankesmedjan Timbro: Absurt att höra en företrädare för Timbro argumentera för att motiv och drivkrafter bakom policy är helt irrelevanta. Är du redan prenumerant, logga in för att fortsätta läsa. Logga in Läs DN +Allt 2 månader för 9 kr Därefter ord. pris 249 kr/mån. DN.se, Expressen.se, lokala nyhetssajter och mer ingår. Det här ingår i DN +Allt Alla artiklar på DN.se och i DN-appen Obegränsad tillgång till Expressen.se och all livesport Över 50 lokala nyhetssajter – från Sydsvenskan i söder till Östersunds-Posten i norr Ekonomi- och börsnyheter online med Privata Affärer och Marknadsnytt – en del av Dagens industri Magasinappen Arcy med över 100 magasin digitalt Dessutom alla artiklar på amelia.se, teknikensvarld.se, mama.se, skonahem.se, alltomresor.se, levaochbo.se, alltommat.se och halsoliv.se Samma inlogg överallt Ett extra konto – bjud in en familjemedlem Läs DN +Allt 2 månader för 9 kr Ditt erbjudande DN +Allt Därefter ord. pris 249 kr/mån. DN.se, Expressen.se, lokala nyhetssajter och mer ingår. Det här ingår Alla artiklar på DN.se och i DN-appen Obegränsad tillgång till Expressen.se och all livesport Över 50 lokala nyhetssajter – från Sydsvenskan i söder till Östersunds-Posten i norr Ekonomi- och börsnyheter online med Privata Affärer och Marknadsnytt – en del av Dagens industri Magasinappen Arcy med över 100 magasin digitalt Dessutom alla artiklar på amelia.se, teknikensvarld.se, mama.se, skonahem.se, alltomresor.se, levaochbo.se, alltommat.se och halsoliv.se Samma inlogg överallt Ett extra konto – bjud in en familjemedlem"
      },
      {
        "title": "Expertens varning: ”Många tror de ska dö i samma ålder som sina föräldrar”",
        "link": "https://www.dn.se/ekonomi/expertens-varning-manga-tror-de-ska-do-i-samma-alder-som-sina-foraldrar/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T12:02:01",
        "summary": "Är det klokt att sträva efter att dö med noll – eller riskerar projektet att slå tillbaka? – Många gör misstaget att spara för lite eller tar ut pensionen på för kort tid eftersom de underskattat hur mycket pengar de behöver, varnar sparekonomen Shoka Åhrman."
      },
      {
        "title": "Insändare. Det måste bli ett stopp för oansvariga utgivare",
        "link": "https://www.dn.se/insandare/det-maste-bli-ett-stopp-for-oansvariga-utgivare/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T11:47:38",
        "summary": "INSÄNDARE. När hat och hot får en partiledare att avgå efter bara fem månader är det uppenbart att förändring krävs. Låt oss återinföra det offentliga samtalets ryggrad – innan fler tystnar, skriver Leif Ekman."
      },
      {
        "title": "Insändare. Nu måste Ulf Kristersson ta itu med SD:s extrema svans",
        "link": "https://www.dn.se/insandare/nu-maste-ulf-kristersson-ta-itu-med-sds-extrema-svans/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T11:35:00",
        "summary": "INSÄNDARE. Efter centerledaren Anna-Karin Hatts avgång på grund av hat och hot är det uppenbart att statsministern inte gjort tillräckligt. Ulf Kristersson (M) måste nu på allvar ta itu med med Sverigedemokraternas extrema svans, skriver Lars Wengrud."
      },
      {
        "title": "Ungern anklagas för att ha försökt rekrytera spioner i Bryssel",
        "link": "https://www.dn.se/varlden/ungern-anklagas-for-att-ha-forsokt-rekrytera-spioner-i-bryssel/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T11:27:18",
        "summary": "Viktor Orbáns man i Bryssel anklagas för att ha varit delaktig i en hemlig spionoperation i Bryssel. Syftet var att rekrytera ungrare som skulle spionera på EU. Ungerns EU-kommissionär Olivér Várhelyi slår ifrån sig anklagelserna, men EU-kommissionen har inlett en utredning."
      },
      {
        "title": "Insändare. Vi måste stoppa hatet mot politiker",
        "link": "https://www.dn.se/insandare/vi-maste-stoppa-hatet-mot-politiker/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T11:24:44",
        "summary": "INSÄNDARE. När Anna-Karin Hatt avgår som partiledare för Centerpartiet ser vi en svensk demokrati som blöder. Om vi inte stoppar hatet mot politiker kommer makten bara att tillhöra dem som klarar av att hata tillbaka, skriver Charlotte Schill Salomonsson."
      },
      {
        "title": "Teorin: Bråk om termosbomber låg bakom mordet i gångtunneln",
        "link": "https://www.dn.se/sverige/teorin-brak-om-termosbomber-lag-bakom-mordet-i-gangtunneln/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T10:51:50",
        "summary": "Ett bråk om termosbomber kan ha legat bakom dödsskjutningen i en gångtunnel i Södertälje i våras. Enligt åtalet lurades mordoffret till platsen och sköts sedan med flera skott. – Han gick dit i tron att han skulle få pengar och vittnen har uppgett att han verkade glad, säger åklagare Markus Hankkio."
      },
      {
        "title": "Anna-Karin Hatt i tårar när hon informerade partiet",
        "link": "https://www.dn.se/sverige/anna-karin-hatt-i-tarar-nar-hon-informerade-partiet/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T10:29:29",
        "summary": "Tårarna rann på fler än den avgående partiledaren vid det interna informationsmötet som hölls strax före pressträffen. Chock och förstämning råder i Centerpartiet efter Anna-Karin Hatts besked – men internt gror också kritiken. – Jag känner bara att vad fan Anna-Karin, sluta inte, säger EU-parlamentarikern Abir Al-Sahlani."
      },
      {
        "title": "Tomas Ramberg: Dramatiska avgången kan leda till borgfred om hat – men den blir kortvarig",
        "link": "https://www.dn.se/sverige/tomas-ramberg-dramatiska-avgangen-kan-leda-till-borgfred-om-hat-men-den-blir-kortvarig/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T10:27:14",
        "summary": "Anna-Karin Hatts dramatiska sorti från partiledarposten kommer först att skapa en politisk borgfred mot hat och polarisering. Men det är bara en tidsfråga innan också den diskussionen blir polariserad med beskyllningar om vem som bär ansvaret för det giftiga klimatet."
      },
      {
        "title": "Mark Normand staplar välrepeterade skämt på hög",
        "link": "https://www.dn.se/kultur/mark-normand-staplar-valrepeterade-skamt-pa-hog/",
        "timestamp": "2025-10-15T16:38:28.650899",
        "published": "2025-10-15T10:04:32",
        "summary": "En utskrift från Dagens Nyheter, 2025-10-15 16:38 Artikelns ursprungsadress: https://www.dn.se/kultur/mark-normand-staplar-valrepeterade-skamt-pa-hog/ Amerikanen Mark Normand må anses vara ung och het men stilen är snarare antik. DN:s Niklas Wahllöf ser en ståuppföreställning som trots tjoflöjtiga skämt går på tomgång. Är du redan prenumerant, logga in för att fortsätta läsa. Logga in Läs gratis i höst, 0 kr fram till 1 jan! För dig som bara vill läsa DN. Passa på – 0 kr fram till 1 jan, sedan endast 85 kr/mån i 6 mån. Därefter 169 kr/mån. Ingen bindningstid, säg upp enkelt när du vill. Det här ingår i DN Enkel Alla artiklar på DN.se och i DN-appen Läs gratis i höst, 0 kr fram till 1 jan! Ditt erbjudande DN Enkel För dig som bara vill läsa DN. Passa på – 0 kr fram till 1 jan, sedan endast 85 kr/mån i 6 mån. Därefter 169 kr/mån. Ingen bindningstid, säg upp enkelt när du vill. Det här ingår Alla artiklar på DN.se och i DN-appen"
      },
      {
        "title": "Björn Wiman: Anna-Karin Hatts avgång är ett jordskalv som får konsekvenser",
        "link": "https://www.dn.se/kultur/bjorn-wiman-anna-karin-hatts-avgang-ar-ett-jordskalv-som-far-konsekvenser/",
        "timestamp": "2025-10-15T16:38:29.427922",
        "published": "2025-10-15T09:46:45",
        "summary": "Centerns partiledare Anna-Karin Hatt avgår bara ett halvår efter tillträdet. Om och om igen visas hur den förgiftade offentligheten är värre för kvinnor. Vi kan inte ha det så här längre, skriver Björn Wiman."
      }
    ],
    "scraped_count": 20,
    "format": "rss",
    "feed_title": "DN.se - Dagens Nyheter"
  },
  {
    "source": "Svenska Dagbladet",
    "type": "news",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Svenska Dagbladet"
  },
  {
    "source": "BBC News",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "Hostage families confirm identities of three of four bodies handed over by Hamas",
        "link": "https://www.bbc.com/news/articles/ced60125zyqo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:26.592341",
        "published": "2025-10-15T09:12:11",
        "summary": "Hostage families confirm identities of three of four bodies handed over by Hamas 5 hours ago Share Save Tom McArthur and Chris Graham Share Save 'We want to raise our children': Life in Gaza after hostages and prisoners released Israeli hostage families have confirmed the identities of three of four bodies handed over by Hamas in Gaza on Tuesday. The bodies of Tamir Nimrodi, 20, Eitan Levy, 53, and Uriel Baruch, 35, were part of the latest return, the Hostages Families Forum said. The fourth body does not match any of the known hostages, Israel said. So far seven hostages' bodies are confirmed to have been sent back from Gaza. Hamas has yet to return the other bodies as agreed under a ceasefire deal brokered by the US. Frustrated by the slow return of bodies, Israel has threatened to further restrict humanitarian aid until the remains of all 28 hostages were returned. Hamas says it has had difficulty locating them. Follow the latest updates 'You're my life, my hero': Hostages reunite with families after two years Palestinians celebrate return of detainees freed by Israel Confirming that examinations at the National Institute of Forensic Medicine found that the remaining unnamed body handed over on Tuesday was not a hostage's, the Israel Defense Forces (IDF) said on X that \"Hamas is required to make all necessary efforts to return the deceased hostages.\" The delay in the return of hostages' bodies - originally envisaged to have been completed on Monday - has caused fury in Israel. On Tuesday, reports suggested Israel would reduce the amount of aid allowed into Gaza and not reopen the Rafah border crossing with Egypt where 600 trucks with food and medical supplies have gathered. Amid reports by Israeli public broadcaster Kan that the crossing in the south of the territory would reopen on Wednesday, Israel clarified that it would only open for the entry and exit of Palestinians and not for the entry of aid. \"Humanitarian aid will not pass through the Rafah crossing. No..."
      },
      {
        "title": "Bowen: Trump's role in Gaza ceasefire was decisive, but not a roadmap to peace",
        "link": "https://www.bbc.com/news/articles/ce86118q6ego?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:27.906583",
        "published": "2025-10-15T06:52:37",
        "summary": "Bowen: Trump's role in Gaza ceasefire was decisive, but not a roadmap to peace 8 hours ago Share Save Jeremy Bowen International editor Share Save 'We want to raise our children': Life in Gaza after hostages and prisoners released Donald Trump's quick trip to Israel and Egypt was the victory lap he wanted. Anyone watching the speeches he made in Jerusalem and Sharm el-Sheikh could see a man luxuriating in his power - enjoying the applause in Israel's parliament, and in Egypt, basking in the fact that so many heads of state and government had flown in. One veteran diplomat in the room said it looked as if Trump saw the role of the world leaders there as extras on his film set. Trump's message at Sharm was, in effect, that he had created a historical turning point. \"All I've done all my life is deals. The greatest deals just sort of happen… That's what happened right here. And maybe this is going to be the greatest deal of them all,\" he said. Observers might also have had the impression from the speeches that the job is done. It is not. Without question, Trump can claim credit for the ceasefire and hostage exchange deal. Qatar, Turkey and Egypt used their leverage with Hamas to force it to accept. That made it a joint effort, but Trump's role was decisive. Live coverage of this story Without his push to demand Israeli Prime Minister Benjamin Netanyahu's agreement to terms that he had previously rejected, the deal would not have been signed. It helps to recognise what the deal is – and what it isn't. The agreement was for a ceasefire and an exchange of hostages for prisoners. It is not a peace agreement, or even the start of a peace process. The next phase of the Trump 20-point plan requires an agreement filling in the gaps of the framework which declares that the Gaza Strip will be demilitarised, secured and governed by a committee including Palestinians. It will report to a Board of Peace chaired by President Trump. Significant work needs to be done on the detail nee..."
      },
      {
        "title": "'Father of our democracy': Kenya's Raila Odinga dies in India aged 80",
        "link": "https://www.bbc.com/news/articles/c1m39xg4dggo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:28.208763",
        "published": "2025-10-15T14:03:33",
        "summary": "'Father of our democracy': Kenya's Raila Odinga dies in India aged 80 22 minutes ago Share Save Basillioh Rukanga Nairobi Share Save Reuters Raila Odinga has been a towering figure in Kenyan politics for many years Former Kenyan Prime Minister Raila Odinga has died at the age of 80, family sources have told the BBC. Odinga died on Wednesday while receiving medical treatment at a hospital in India. He collapsed during a morning walk and was taken to Devamatha Hospital, which said he had suffered a cardiac arrest. It said he did not respond to resuscitation measures and was \"declared dead at 09:52\" local time (04:22 GMT). In recent weeks, there has been speculation about his health, although family members and political allies had dismissed reports suggesting he was critically ill. President William Ruto paid tribute to Odinga as a \"beacon of courage\" and \"father of our democracy\". \"Raila Amolo Odinga is truly a once-in-a-generation leader. A man whose ideals transcended politics, and whose legacy will shape the destiny of Kenya for generations to come,\" Ruto said in a live address to the nation. A seven-day period of mourning has also been declared. Odinga will be also be accorded a state funeral with full military honours, Ruto said. Raila Odinga: A founding father of Kenya's multi-party democracy How Odinga's court challenges have improved Kenya's elections Other Kenyan politicians and world leaders have been sending their condolences, including Indian Prime Minister Narendra Modi, who described Odinga as a \"towering statesman and a cherished friend of India\". South Africa's President Cyril Ramaphosa said he was a \"leader who placed the interests of his country and continent first\" while Zambia's Hakainde Hichilema described Odinga as \"a towering advocate for democracy\", whose legacy would endure. On Wednesday, Kenya's parliament observed a minute's silence in his honour and scheduled a session on Thursday for lawmakers to pay tribute. The Kenyan president had earl..."
      },
      {
        "title": "China seizes 60,000 maps over 'mislabelled' Taiwan",
        "link": "https://www.bbc.com/news/articles/czr1myxe673o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:28.493076",
        "published": "2025-10-15T05:51:29",
        "summary": "China seizes 60,000 maps over 'mislabelled' Taiwan 9 hours ago Share Save Koh Ewe Share Save China Customs Customs officers recently seized a batch of maps bound for export, which they described as \"problematic\" Chinese customs officers in eastern Shandong province have seized 60,000 maps that \"mislabelled\" the self-governed island of Taiwan, which Beijing claims as part of its territory. The maps, authorities said, also \"omitted important islands\" in the South China Sea, where Beijing's claims overlap with those of its neighbours, including the Philippines and Vietnam. The \"problematic\" maps, meant for export, cannot be sold because they \"endanger national unity, sovereignty and territorial integrity\" of China, authorities said. Maps are a sensitive topic for China and its rivals for reefs, islands and outcrops in the South China Sea. China Customs said that the maps also did not contain the nine-dash line, which demarcates Beijing's claim over nearly the entire South China Sea. The line comprises nine dashes which extends hundreds of miles south and east from its most southerly province of Hainan. The seized maps also did not mark the maritime boundary between China and Japan, authorities said. Authorities said the maps mislabelled \"Taiwan province\", without specifying what exactly the mislabelling was. China sees self-ruled Taiwan its territory and has not ruled out the use of force to take the island. But Taiwan sees itself as distinct from the Chinese mainland, with its own constitution and democratically-elected leaders. Tensions in the South China Sea flare up occassionally - most recently over the weekend, when ships from China and the Philippines figured in another encounter. Manila accused a Chinese ship of deliberately ramming and firing its water cannon at a Philippine government vessel. But Beijing said the incident happened after the Philippine vessel ignored repeated warnings and \"dangerously approached\" the Chinese ship. The Philippines and Vietnam a..."
      },
      {
        "title": "Madagascar military says it has seized power as president moves to 'safe place'",
        "link": "https://www.bbc.com/news/articles/cn8xjjdgl8vo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:28.713966",
        "published": "2025-10-14T19:55:46",
        "summary": "Madagascar military says it has seized power as president moves to 'safe place' 18 hours ago Share Save Sammy Awami BBC Africa, Antananarivo and Danai Nesta Kupemba Share Save Madagascar crowds cheer as military unit seizes power An elite military unit says it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests in the Indian Ocean island. Standing outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. He also suspended key democratic institutions, like the electoral commission. Gen Z protesters will be part of the changes because \"the movement was created in the streets so we have to respect their demands\", he added. Troops and protesters have been celebrating the apparent ousting of President Rajoelina, with thousands waving flags in the capital, Antananarivo. CAPSAT, or the Personnel Administration and Technical and Administrative Services Corps, is the most powerful military unit in Madagascar. The unit supported Rajoelina when he came into power in 2009, but joined the protesters on Saturday. Madagascar's constitutional court has named Col Randrianirina as the country's new leader, even though a statement from the president's office said he was still in charge and denounced what it described as an \"attempted coup d'etat\". 'We have seized power,' says head of military unit Rajoelina's whereabouts are unknown, but he has said he is sheltering in a \"safe place\" following an alleged attempt on his life by \"military personnel and politicians\". CAPSAT has denied any involvement in any such move. There have been unconfirmed reports that the president was flown out of the country on a French military aircraft. As it happened: Madagascar military says it has seized power My one-month-old grandson was killed by police tear gas during Madagascar protests Also on Tuesday the US state department urged all sides \"to pursue ..."
      },
      {
        "title": "Bangladesh garment factory fire kills at least 16",
        "link": "https://www.bbc.com/news/articles/crexjqpw557o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:28.983292",
        "published": "2025-10-15T06:56:42",
        "summary": "Bangladesh garment factory fire kills at least 16 8 hours ago Share Save Sayeda Akter BBC Bangla, Dhaka and Kelly Ng Singapore Share Save Watch: Families appeal for missing loved ones after chemical warehouse fire At least 16 people have died after a huge fire broke out at a garment factory in Bangladesh, with officials warning that the toll could rise. Sixteen bodies have been recovered and would be handed to families after DNA testing, as they have been burnt beyond recognition, the fire service said. Distraught relatives gathered outside the four-storey factory in Dhaka's Mirpur area on Tuesday in search of their loved ones still missing. The blaze, which broke out at the factory around midday, was extinguished after three hours. But an adjacent chemical warehouse continued to burn, authorities said. Large fires are relatively common in densely populated Bangladesh, often due to lax safety standards and poor infrastructure. Hundreds of people have been killed in fires in recent years. Up until 21:00 local time (15:00 GMT) on Tuesday, the fire at the chemical warehouse in Mirpur had not been completely doused, media reports said. Fire service officials have not ascertained which of the two buildings caught fire first. According to eyewitnesses, the chemical warehouse stored bleaching powder, plastic and hydrogen peroxide, all of which can intensify fires. Plastic also releases toxic fumes when burned. Most of the deaths were caused by toxic gas and the building's roof door being locked, the fire service said. Fire service director Mohammad Tajul Islam Chowdhury told local media the victims probably died \"instantly\" after inhaling \"highly toxic gas\". Police and military officers are still trying to locate the owners of the factory and the warehouse, Mr Chowdhury told reporters. An investigation into whether the warehouse was operating legally was also ongoing, he added. The fire service said that the chemical warehouse had no fire safety clearance or licence from t..."
      },
      {
        "title": "'He transformed R&B forever' - Stars pay tribute to D’Angelo, after his death at 51",
        "link": "https://www.bbc.com/news/articles/cwynv40ly4vo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:29.380383",
        "published": "2025-10-15T08:42:29",
        "summary": "'He transformed R&B forever' - Stars pay tribute to D’Angelo, after his death at 51 6 hours ago Share Save Ana Faguy and Mark Savage Music correspondent Share Save Frans Schellekens/Redferns Fellow musicians Beyoncé, Nile Rogers and Lauryn Hill were among those paying their respects to D'Angelo Tributes have flooded in for the R&B and soul singer D’Angelo, who has died aged 51 after a pancreatic cancer diagnosis. In a statement, his family wrote that the star, whose real name was Michael Eugene Archer, left behind a \"legacy of extraordinarily moving music\" and asked fans to celebrate “the gift of song that he has left for the world”. The influential singer was known for pioneering neo-soul, a genre blending R&B with other types of music, including hip-hop and jazz. His three albums won four Grammy Awards. The music video for his hit song Untitled (How Does It Feel) became notorious for its smouldering, single-shot performance, where D’Angelo appeared to be performing naked. \"The shining star of our family has dimmed his light for us in this life,\" his family said in a statement obtained by CBS News, the BBC’s US media partner. Fellow musicians Beyoncé, Nile Rogers and Lauryn Hill were among those paying their respects. 'Strength and sensitivity' Singer Beyoncé thanked D’Angelo for his music on her website. \"You were the pioneer of neo-soul, and that changed and transformed rhythm and blues forever,\" she wrote. \"We will never forget you.\" Writing about his first meeting with D'Angelo, guitarist and producer Rogers recalled having encouraged the late star - who was then on the way up - to put out his material as it was \"perfect\". \"About a year later I heard one of those songs on the radio. It was genius and it was exactly what he had played for me,\" wrote Rogers. \"I know... I still have the original cassette.\" Singer and rapper Hill, who worked with D'Angelo at the start of his career, shared a similarly lengthy and personal reflection, saying his \"beauty and talent w..."
      },
      {
        "title": "ChatGPT will soon allow erotica for verified adults, says OpenAI boss",
        "link": "https://www.bbc.com/news/articles/cpd2qv58yl5o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:29.824653",
        "published": "2025-10-15T11:22:42",
        "summary": "ChatGPT will soon allow erotica for verified adults, says OpenAI boss 3 hours ago Share Save Lily Jamali North America Technology Correspondent and Liv McMahon BBC Technology Journalist Share Save Reuters OpenAI plans to allow a wider range of content, including erotica, on its popular chatbot ChatGPT as part of its push to \"treat adult users like adults\", says its boss Sam Altman. In a post on X on Tuesday, Mr Altman said upcoming versions of the popular chatbot would enable it to behave in a more human-like way - \"but only if you want it, not because we are usage maxxing\". The move, reminiscent of Elon Musk's xAI's recent introduction of two sexually explicit chatbots to Grok, could help OpenAI attract more paying subscribers. It is also likely to intensify pressure on lawmakers to introduce tighter restrictions on chatbot companions. OpenAI did not respond to the BBC's requests for comment. Mr Altman said OpenAI had previously made ChatGPT \"pretty restrictive to make sure we were being careful with mental health issues\". These changes were announced in a blog post in August, which no longer appears on OpenAI's website. \"We realise this made it less useful/enjoyable to many users who had no mental health problems, but given the seriousness of the issue we wanted to get this right,\" Mr Altman posted on Tuesday. He said ChatGPT could soon relax the restrictions \"now that we have been able to mitigate the serious mental health issues and have new tools\". He added: \"In December, as we roll out age-gating more fully and as part of our 'treat adult users like adults' principle, we will allow even more, like erotica for verified adults.\" The changes come after OpenAI was sued earlier this year by parents of a US teen who took his own life. The lawsuit filed by Matt and Maria Raine, who are the parents of 16-year-old Adam Raine, was the first legal action accusing OpenAI of wrongful death. The family included chat logs between Adam, who died in April, and ChatGPT that sho..."
      },
      {
        "title": "Bitcoin worth $14bn seized in US-UK crackdown on alleged scammers",
        "link": "https://www.bbc.com/news/articles/c70jw436n0yo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:29.983083",
        "published": "2025-10-15T03:51:04",
        "summary": "Bitcoin worth $14bn seized in US-UK crackdown on alleged scammers 11 hours ago Share Save Lauren Turner and Osmond Chia Share Save Reuters The US government has seized more than $14bn (£10.5bn) in bitcoin and charged the founder of a Cambodian business empire, the Prince Group, with allegedly masterminding a massive cryptocurrency scam, which involved forced labour camps. UK and Cambodian national Chen Zhi was charged on Tuesday in New York for allegedly engaging in a wire-fraud conspiracy and money laundering scheme. Mr Chen's businesses were also sanctioned by the US and the UK as part of a joint operation. The UK government says it has frozen assets owned by his network, including 19 properties in London - one of which is worth nearly £100m ($133m). The BBC has contacted the Prince Group for comment. US prosecutors said it was one the biggest financial takedowns in history and the largest ever seizure of bitcoin, with approximately 127,271 bitcoin being held by US government. Mr Chen, who remains at large, is accused of being the mastermind behind a \"sprawling cyber-fraud empire\" operating under his multi-national company, the Prince Group, said the US Department of Justice (DOJ) . The Cambodia-based group's website says its businesses include property development, and financial and consumer services. But the DOJ alleges that it runs one of Asia's largest transnational criminal organisations. Unwitting victims were contacted online and convinced to transfer cryptocurrency based on false promises that the funds would be invested and generate profits, the DOJ said. Prosecutors alleged that the company, under Mr Chen's direction, built and operated at least ten scam compounds throughout Cambodia, according to court documents seen by the BBC. Mr Chen was accused of managing the compounds that were specially designed to reach as many victims as possible, said prosecutors. His accomplices allegedly procured millions of mobile phone numbers and set up \"phone farms\" to c..."
      },
      {
        "title": "Trump says US will not 'waste our time' helping Argentina if Milei loses",
        "link": "https://www.bbc.com/news/articles/cg7n82gd7pvo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:30.174457",
        "published": "2025-10-14T23:17:50",
        "summary": "Trump says US will not 'waste our time' helping Argentina if Milei loses 15 hours ago Share Save Ione Wells South America correspondent Share Save Trump: US won't 'waste our time' with Argentina if Javier Milei loses election President Donald Trump has acknowledged that a $20bn (£15bn) US lifeline to help calm Argentina's currency crisis is an attempt to sway legislative elections this month in the South American nation. Welcoming Argentina's libertarian leader Javier Milei to the White House, Trump warned that the US would not \"waste our time\" with helping Argentina if Milei's party did not prevail. Milei praised Trump for his peacemaking efforts and said the US president's policies would lead to \"prosperity\". Argentina's financial turmoil comes ahead of national midterm elections on 26 October, seen as a test of voters' desire to continue backing Milei's cost-cutting, free-market reform agenda. As Trump sat across the table from his Argentine counterpart on Tuesday, he said the not-so-quiet bit out loud. \"The election is coming up very soon,\" he said. \"It's a very big election.\" Trump added: \"Victory [for Milei] is very important. Your poll numbers I hear are pretty good. I think they will be better after this. Watch: President Trump greets Argentine President Javier Milei at White House \"And, you know, our approvals are somewhat subject to who wins the election.\" A presidential election is not due in Argentina until 2027. But Trump said if \"a socialist wins\" then the US would feel \"a lot differently\" about supporting the South American nation. \"If he loses, we are not going to be generous with Argentina,\" Trump said. For his part, Milei blamed Argentina's economic woes on his political adversaries. \"This liquidity problem that Argentina has is a result of the political attacks we have suffered from our opponents,\" he told Trump. How Milei's 'Thatcherite' economics divided his nation - but won over Trump Trump is bailing out Argentina. What happened to 'America fi..."
      },
      {
        "title": "French PM backs freezing Macron's pension reform to save government",
        "link": "https://www.bbc.com/news/articles/crkldd02xg8o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:30.477999",
        "published": "2025-10-14T16:16:50",
        "summary": "French PM backs freezing Macron's pension reform to save government 22 hours ago Share Save Laura Gozzi and Paul Kirby Europe digital editor Share Save Bloomberg via Getty Images Sébastien Lecornu announced the planned suspension two days before his new government faced votes of confidence French Prime Minister Sébastien Lecornu has told parliament he backs suspending controversial 2023 pension reforms, in the face of crucial votes of no-confidence later this week. The changes, which raised the retirement age from 62 to 64, were seen as signature reforms in Emmanuel Macron's presidency. \"This autumn I will propose to parliament that we suspend the 2023 pension reform until the [2027] presidential election,\" Lecornu said to applause from left-wing parties. Lecornu was reappointed prime minister last week only four days after he resigned, and needs the support of Socialist MPs in parliament if his government is to survive. Opposition parties on the far right and far left have called confidence votes, known as \"censure\" votes on Lecornu's government, for Thursday morning and are demanding parliamentary elections. The Socialists said they would be prepared to support the new government, but only if it promises a complete suspension of Macron's pension changes. \"If he does not explicitly say the words 'immediate and complete suspension of the pension reform', it will be censure,\" Socialist MP Laurent Baumel said earlier on French TV. \"He is holding his destiny in his own hands. He knows what he has do if he doesn't want to be the prime minister who resigns every week.\" The reforms were finally pushed through parliament in March 2023, less than a year after Macron was voted in for a second presidential term. There had been months of political debate, strikes and street protests, and in the end the bill had to go through without a vote in parliament using a constitutional mechanism known as 49:3. Last week, Lecornu said it was something many French people remembered as a \"..."
      },
      {
        "title": "US strikes another vessel off Venezuela coast, killing six",
        "link": "https://www.bbc.com/news/articles/cg51625lmmgo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:30.916113",
        "published": "2025-10-14T21:03:33",
        "summary": "US strikes another vessel off Venezuela coast, killing six 18 hours ago Share Save Ione Wells South America Correspondent and Nadine Yousif Share Save Reuters The US struck a vessel off the coast of Venezuela The US has struck another vessel off the coast of Venezuela on Tuesday, killing six people, President Donald Trump has said. In a post on Truth Social, Trump said the vessel belonged to \"narcoterrorists\" and that it was \"trafficking narcotics\". This is the fifth strike of its kind by the Trump administration on a boat accused of trafficking drugs on international waters since September. In total, 27 people have been reported killed, but the US has not provided evidence or details about identities of the vessels or those on board them. Some lawyers have accused the US of breaching international law, and neighbouring nations like Colombia and Venezuela have condemned the strikes. In his Truth Social post, Trump said \"intelligence confirmed the vessel was trafficking narcotics, was associated with illicit narcoterrorist networks, and was transiting along a known\" route for smuggling. He also posted an aerial surveillance video showing a small boat on water that is struck by a missile and explodes. US strike on 'Venezuela drug boat': What do we know, and was it legal? What is Trump's goal as US bombs 'Venezuela drugs boat'? Trump did not specify the nationality of those on board, or what drug smuggling organisation they are suspected of belonging to. He added that no US military personnel were injured. The strike comes after a recent leaked memo sent to Congress, and reported on by US media, that said the administration determined the US was in a \"non-international armed conflict\" with drug cartels. It has also deployed multiple warships to the Caribbean. The US has positioned its strikes on alleged drug-trafficking vessels as self-defence. Many lawyers questioning the legality of such military action. Framing this as an active armed conflict is likely a way for Tr..."
      },
      {
        "title": "French pair sentenced in Iran on spying charges",
        "link": "https://www.bbc.com/news/articles/cwyplx3xz47o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:31.152956",
        "published": "2025-10-14T18:30:18",
        "summary": "French pair sentenced in Iran on spying charges 20 hours ago Share Save Aleks Phillips Share Save Getty Images Cecile Kohler and Jacques Paris have been detained in Iran since they were arrested in May 2022 Two French nationals have been handed lengthy prison sentences by a court in Iran after being convicted of espionage, Iranian state media reports. The reports do not name the defendants but they are believed to be Cecile Kohler, 40, and her partner Jacques Paris, 72, the only French nationals being held in Iran. They were arrested in May 2022 during a tourist trip. The pair have been found guilty of spying on behalf of both France and Israel, the reports say. The announcement comes more than a month after Iranian Foreign Minister Abbas Araghchi said a deal to exchange French detainees for an Iranian woman held in France was nearly complete. Iran has previously said Kohler and Paris could be released as part of that agreement. Another French tourist, Olivier Grondeau, 34, was released by Iran earlier this year after being handed a five-year prison sentence for \"conspiracy against the Islamic republic\". Iran's judicial news agency Mizan said one of the defendants was sentenced to six years in prison for spying for France, five years for conspiracy against national security and 20 years in exile for \"intelligence co-operation\" with Israel. The other was sentenced to 10 years in prison for spying for France, five years for conspiring against national security and 20 years in exile for being complicit in intelligence co-operation with Israel. Under Iranian law, jail sentences run concurrently. It is unclear what \"exile\" entails, though in other instances convicts have been sent to remote areas. Mizan reports that their pre-trial detention would be deducted from their sentences and that the verdict could be contested within 20 days. France has accused Iran of holding Kohler and Paris arbitrarily and keeping them in conditions akin to torture. Iran denies the claims. Hu..."
      },
      {
        "title": "Man who set fire to Pennsylvania governor’s mansion jailed",
        "link": "https://www.bbc.com/news/articles/cdegnne8r3go?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:31.279765",
        "published": "2025-10-14T16:58:35",
        "summary": "Man who set fire to Pennsylvania governor’s mansion sentenced 20 hours ago Share Save Ana Faguy Share Save Watch: Surveillance video shows suspect setting Pennsylvania governor's mansion on fire The man accused of setting Pennsylvania Governor Josh Shapiro’s residence on fire in April was sentenced to 25 to 50 years in state prison as part of a plea deal. Cody Balmer, 38, pleaded guilty to attempted murder, aggravated arson, 22 counts of arson, burglary and other offenses at a court hearing on Tuesday. While the official residence in the state capital of Harrisburg was severely damaged during the fire, people home at the time - including Shapiro, his wife, his four children, and guests and staff members - were able to escape unscathed. Shapiro said his family was supportive of the plea agreement announced by prosecutors. The attack against the governor and his family is part of a wave of political violence in the US, including attempted kidnapping of Michigan Governor Gretchen Whitmer, two assassination attempts against President Donald Trump, the killings of two Minnesota state officials and the killing of commentator Charlie Kirk. At a press conference on Tuesday, the Pennsylvania governor - standing alongside his wife - said his family has had to lean on their faith as they navigated a difficult recovery since the attack. “We will forever be changed by this, we know that time will heal, but the scars will remain,” Shapiro said. Balmer was accused of breaking into the govenor's residence and setting it on fire on the second day of Passover. The governor, who is Jewish, had hosted a Passover celebration the night before. Getty Images The gutted interior of the governor's residence Balmer had admitted to officials that he removed petrol from a lawn mower and poured it into beer bottles to make Molotov cocktails he used in the attack, Pennsylvania State Police said. He turned himself in 13 hours after the break-in and admitted to “harbouring hatred toward Governor Sh..."
      },
      {
        "title": "US Supreme Court rejects Alex Jones appeal in Sandy Hook shooting case",
        "link": "https://www.bbc.com/news/articles/c5ypjjxd40qo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:31.423101",
        "published": "2025-10-14T17:12:21",
        "summary": "US Supreme Court rejects Alex Jones appeal in Sandy Hook shooting case 20 hours ago Share Save Ana Faguy Washington Share Save Reuters Conspiracy theorist Alex Jones The US Supreme Court has rejected a request from right-wing conspiracy theorist Alex Jones to overturn the nearly $1.5bn (£1.1bn) defamation judgment against him. Jones was ordered to make the payout in 2022 for claiming the 2012 mass shooting at Sandy Hook Elementary School - which killed 20 schoolchildren and six educators - was a hoax. In order to make that payout, Jones was being forced to sell his Infowars media company to the satirical news site The Onion. He told the highest US court the sale would cause irreparable harm to him and his audience of 30 million. Jones has not yet paid any of the damages he owes Sandy Hook families. The Supreme Court did not explain its decision to deny his request. Jones’s lawyers had made a free speech argument - that he should have the same protections under the First Amendment of the Constitution that journalists have. And Jones argued the financial consequences were too steep. \"The result is a financial death penalty by fiat imposed on a media defendant whose broadcasts reach millions,\" he told the Supreme Court in the appeal. Chris Mattei, a lawyer for the Sandy Hook families, said in a statement provided to BBC that the court “properly rejected Jones's latest desperate attempt to avoid accountability for the harm he has caused. \"We look forward to enforcing the jury's historic verdict and making Jones and Infowars pay for what they have done.\" While The Onion's attempt to buy Infowars was rejected by a bankruptcy judge last year, Infowars could soon be up for sale again, giving The Onion another chance. Legal pressure against Jones has been mounting since he was found liable by two juries for defamation and emotional distress over his lies about the Sandy Hook school shooting. After the first verdict in Connecticut, Jones filed for bankruptcy protection in Tex..."
      },
      {
        "title": "National strike hits Belgian public transport, airports and ships",
        "link": "https://www.bbc.com/news/articles/c62e3pny6p7o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:31.486256",
        "published": "2025-10-14T12:38:32",
        "summary": "National strike by Belgium's big unions hits public transport, airports and ships 1 day ago Share Save Bruno Boelpaep In Brussels and Paul Kirby Europe digital editor Share Save Police used water cannon and tear gas at one point when the protest turned violent Tens of thousands of people have taken to the streets in Brussels as part of a national strike over government reforms and spending cuts that has brought flights to a halt and severely disrupted public transport. Belgium's three big unions are protesting over pensions and other measures by Prime Minister Bart de Wever's centre-right government aimed at cutting the budget deficit. There were no services at Belgium's second biggest airport at Charleroi, and all departures and many of the arrivals were cancelled at Brussels Airport. Although trains were running, most buses, trams and underground trains in the capital ground to a halt. Shipping at Europe's second biggest port Antwerp was suspended until Wednesday because of understaffing, and more than 100 ships waited in the North Sea for permission to dock at three ports, according to Belgium's MDK maritime and coastal services. Belgium has been hit by several strikes since Flemish nationalist Bart de Wever came to office last February. By midday, police said 80,0000 protesters had joined the demonstration in the Belgian capital. Reuters Demonstrators held a banner that read \"social health: vital\" Public sector workers were protesting against austerity measures and a government increasingly perceived as leaning right. They wound through the streets of central Brussels, many wearing the red or green colours of the main unions. A key issue for the unions is the government's plan to increase the number of days Belgians work per year before they can receive their pensions, as well as the end of special schemes for several sectors including military and railway workers. De Wever's government has also announced measures including a maximum two-year limit on claiming u..."
      },
      {
        "title": "Spain's radically different approach to African migration",
        "link": "https://www.bbc.com/news/articles/cn409ld50kvo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:32.262367",
        "published": "2025-10-15T00:15:15",
        "summary": "Spain's radically different approach to African migration 14 hours ago Share Save Paul Melly West Africa analyst Share Save AFP via Getty Images Spain is kicking against the prevailing political mood among Western nations when it comes to migration and policies regarding the African continent. At a time when the US, the UK, France and Germany are all cutting back their development aid budgets, Madrid remains committed to continued expansion, albeit from a lower starting point. This week, the Spanish capital has been hosting an African Union-backed \"world conference on people of African descent\". AfroMadrid2025 will discuss restorative justice and the creation of a new development fund. It is just the latest sign of how Spain's socialist-led government is seeking to deepen and diversify its engagement with the continent and near neighbour that lies just a few kilometres to the south, across the Straits of Gibraltar. In July Foreign Minister José Manuel Albares launched a new advisory council of prominent intellectual, diplomatic and cultural figures, more than half of them African, to monitor the delivery of the detailed Spain-Africa strategy that his government published at the end of last year. New embassies south of the Sahara, and partnerships in business and education are planned. The contrast between Spain's approach and that of others in the West is not just in spending but in tone and mindset – and nowhere more so than in dealing with migration. Similar to elsewhere in Europe, Prime Minister Pedro Sanchez is looking for ways to contain the influx of irregular arrivals. Like other centre-left and centre-right leaders, he finds himself facing an electoral challenge from the radical right, largely driven by some voters' concern over migration, with the hardline Vox party well established in parliament and routinely ranking third in opinion polls. In July, extra security forces had to be deployed against racist gangs roaming the streets of Torre Pacheco, in Murci..."
      },
      {
        "title": "The Indian woman who stood up to moral policing - and won a pageant",
        "link": "https://www.bbc.com/news/articles/cqlzqzlnvvpo?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:32.374240",
        "published": "2025-10-14T23:10:21",
        "summary": "The Indian woman who stood up to moral policing - and won a pageant 15 hours ago Share Save Geeta Pandey BBC News, Delhi Share Save Muskan Sharma Muskan Sharma has dedicated her crown to her mother Muskan Sharma stood up to men who tried to bully her over her clothes - and went on to win hearts and a beauty pageant. The 23-year-old, who was crowned Miss Rishikesh 2025 last week in the northern Indian state of Uttarakhand, told the BBC that even though it was a small local pageant, \"it made me feel like Miss Universe\". Sharma's win has made headlines in India as it came after a viral video that showed her spiritedly arguing with a man who barged into their rehearsals just a day before the 4 October contest. Sharma, who \"wanted to be a model and participate in a pageant since I was in school\", said the intruders came in just as they broke for lunch. \"We were sitting around, chilling, having a laugh when they walked in,\" she said. The footage showed Raghavendra Bhatnagar, district head of a Hindu group called Rashtriya Hindu Shakti Sangathan, objecting to skirts and western dresses Sharma and other contestants were wearing. \"Modelling is over, go back home,\" Bhatnagar is heard telling them. \"This is against Uttarakhand's culture.\" Sharma refuses to back down. \"Why don't you shut the shops which sell them [Western clothes]?\" She then tells him that he should expend his energies on things that are worse than women's clothing - social evils such as drinking and smoking. \"There's a shop right outside that sells cigarettes and alcohol. Why don't you shut that down? First stop those things and I will stop wearing these clothes,\" she says. The man snaps at her saying \"don't tell me what to do\". Likewise, she retorts. \"If you have the right to choose, then so do we. Our opinion matters as much as yours,\" she says. As the argument continues, Sharma is joined by some of the other contestants and organisers and Bhatnagar and his group, who threatened to stop the show, are finally..."
      },
      {
        "title": "What happens next in Trump's ceasefire plan?",
        "link": "https://www.bbc.com/news/articles/cvgqx7ygq41o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:32.453371",
        "published": "2025-10-14T12:27:36",
        "summary": "What happens next in Gaza ceasefire plan after hostage release? 1 day ago Share Save Share Save Reuters Armed Palestinian fighters pictured ahead of a handover of hostages in Gaza The leaders of Egypt, Turkey and Qatar have joined US President Donald Trump in signing a commitment to implement his plan to end the two-year war between Israel and Hamas in the Gaza Strip. It came at the end of a day that saw Hamas hand over all 20 living hostages it was holding in Gaza in exchange for the release of almost 2,000 Palestinian prisoners and detainees held in Israeli jails. Hamas also handed over the bodies of four deceased hostages. Israel says the remains of 24 others remain in Gaza and must be returned without delay under the ceasefire agreement. The first phase of Trump's plan saw the ceasefire come into effect at 12:00 (09:00 GMT) on 10 October and increased amounts of humanitarian aid enter the Strip. Israeli troops also pulled back to a line that has left them in control of 53% of Gaza - the first of three stages of Israeli withdrawal, according to the Trump plan. Here's what we know. Follow live coverage here What happens now? Two elements in the first phase of Trump's 20-point peace plan remain incomplete - the entry of aid into Gaza without restrictions, including the reopening of the Rafah crossing with Egypt, and the handover of all deceased hostages. Israel said it received the remains of four hostages on 13 October. However, it has said there are another 24 bodies still in Gaza and the deadline for returning them passed at 12:00 local time (09:00 GMT) the same day. \"We demand that Hamas uphold its part of the agreement,\" an Israeli official said, adding the Israeli military \"will not rest until all return to their families and to burial in Israel\". A copy of the ceasefire agreement published by Israeli media last week appeared to acknowledge that Hamas and other Palestinian factions might not be able to locate all of the bodies within that time frame. An Israe..."
      },
      {
        "title": "24 hours with Trump on diplomatic tornado through Middle East",
        "link": "https://www.bbc.com/news/articles/c93xprvdy23o?at_medium=RSS&at_campaign=rss",
        "timestamp": "2025-10-15T16:38:32.516854",
        "published": "2025-10-14T15:08:41",
        "summary": "24 hours with Trump on diplomatic tornado through Middle East 22 hours ago Share Save Tom Bateman State department correspondent travelling on Air Force One Share Save Watch: \"I'm talking about rebuilding Gaza\", Trump tells the BBC's Tom Bateman US President Donald Trump's day-long trip to the Middle East came as the Gaza deal was clinched: an agreement coming into force amounting to one of the most critical moments yet after two years of catastrophic war. Painting as he does in primary colours, Trump's portrayal was vivid - of the biggest turning point in three millennia. On the return flight in the early hours of Tuesday, he reflected that it had been a \"historic day, to put it mildly\". He had earlier suggested \"everlasting peace\" had been grasped under his tutelage, in a region long convulsed by violence. As part of the White House press corps, we were travelling on Air Force One – which is how I found myself at the centre of this US diplomatic tornado. As we headed for Tel Aviv, the presidential plane took a turn to do a fly-by of the beach. It dipped a wing so we could get a view of a giant sign atop the sand that said \"thank you\" to Trump, and featured the Israeli flag as well as an outline of the US president's head in profile. Reuters The manoeuvre set the mood for a trip that was a victory lap, rather than an exercise in setting out the punishing detail for starting \"phase two\" of the negotiations and securing a longer-term future for Gaza. The agreement made in Doha last week was under intensive pressure on the sides from Trump. It marked one of the most profound moments for millions of people in the last two years: major combat operations in Gaza ceased, the remaining living hostages held by Hamas released in exchange for Palestinian prisoners held by Israel, and Palestinians in Gaza returning to the ruins of their homes in the north amid a partial withdrawal by Israeli troops. But I found Trump's journey was in fact to a waypoint, not a destination - a f..."
      }
    ],
    "scraped_count": 20,
    "format": "rss",
    "feed_title": "BBC News"
  },
  {
    "source": "Euronews",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "Spain holds national strike in solidarity with Palestinians",
        "link": "http://www.euronews.com/video/2025/10/15/spain-holds-national-strike-in-solidarity-with-palestinians",
        "timestamp": "2025-10-15T16:38:26.391174",
        "published": "2025-10-15T14:26:49",
        "summary": "The action, called by several pro-Palestinian unions and associations, included 24-hour strikes, demonstrations, and partial work stoppages across workplaces and schools. The strike took place just days after the announcement of the first phase of a peace plan between Israel and Hamas, presented by US President Donald Trump. Despite the diplomatic breakthrough, organisers pressed ahead, urging the suspension of all work and educational activities to demand an end to the violence in Gaza and the severing of ties with Israel. Protests were reported in major cities including Madrid, Barcelona, and Seville, where marchers carried Palestinian flags and banners calling for peace and justice. Unions said the mobilisation was both a show of solidarity with civilians in Gaza and a demand for Spain to take a stronger political stance in response to the ongoing conflict."
      },
      {
        "title": "Qatar and Chile collaborate to plant seeds of heritage and strokes of tradition",
        "link": "http://www.euronews.com/culture/2025/10/15/qatar-and-chile-collaborate-to-plant-seeds-of-heritage-and-strokes-of-tradition",
        "timestamp": "2025-10-15T16:38:27.020273",
        "published": "2025-10-15T14:20:42",
        "summary": "By Euronews Published on 15/10/2025 - 16:20 GMT+2 Share this article Share this article Facebook Twitter Flipboard Send Reddit Linkedin Messenger Telegram VK Bluesky Threads Whatsapp Copy/paste the article video embed link below: Copied In the coastal village of Matanzas, Chile, volunteers from Qatar Museums’ Years of Culture programme join locals to restore native plants and paint a mural celebrating Qatari and Chilean heritage. ADVERTISEMENT Native plants have been fortifying the picturesque cliffs of Matanzas in Chile for centuries. Today, community-driven initiatives are repopulating these indigenous shrubs. Volunteers from Qatar Museums’ Years of Culture programme are getting their hands dirty, guided by local landscaper Ignacia Echeverria. Meanwhile, another group of volunteers are beautifying the walls of the community center, by painting a mural, which features Qatari and Chilean motifs. Despite being thousands of kilometers apart, volunteer Soha Raslan was enlightened to find that the two countries have more similarities than differences. Go to accessibility shortcuts Share this article Read more Cult Innovation by Design Summit: Doha’s Creative Future In partnership with Media City Cult Art as a voice for Sudan’s unseen struggles In partnership with Media City Cult ‘A Seat at the Table’ exhibition in Doha In partnership with Media City Tradition Culture Qatar Chile"
      },
      {
        "title": "Rome clears EU-bound budget draft with healthcare trims",
        "link": "http://www.euronews.com/business/2025/10/15/rome-clears-eu-bound-budget-draft-amid-healthcare-trims",
        "timestamp": "2025-10-15T16:38:27.588604",
        "published": "2025-10-15T14:11:18",
        "summary": "With the EU’s filing deadline looming, Rome approved its draft budget plan on Tuesday and will reconvene this Friday to lock in the tax cuts and funding. That's before sending the full budget bill to parliament by 20 October."
      },
      {
        "title": "From regional unity to global influence: Turkic nations set bold vision in Azerbaijan",
        "link": "http://www.euronews.com/business/2025/10/15/from-regional-unity-to-global-influence-turkic-nations-set-bold-vision-in-azerbaijan",
        "timestamp": "2025-10-15T16:38:27.588604",
        "published": "2025-10-15T14:00:13",
        "summary": "By Bojan Brkic Published on 15/10/2025 - 16:00 GMT+2 Share this article Share this article Facebook Twitter Flipboard Send Reddit Linkedin Messenger Telegram VK Bluesky Threads Whatsapp Copy/paste the article video embed link below: Copied Leaders of the Turkic states meet in Gabala, Azerbaijan, affirming their growing global influence and commit to stronger economic, cultural, and defence cooperation. ADVERTISEMENT Amid shifting geopolitical dynamics and rising economic potential, the Turkic states are gaining new weight on the global stage. This growing influence framed the 12th Presidential Summit of the Organisation of Turkic States (OTS), held in Azerbaijan’s historic city of Gabala. Leaders from Turkey, Azerbaijan, Kazakhstan, Uzbekistan, Kyrgyzstan, and observer states Turkmenistan and Hungary, met to deepen cooperation across more than 40 sectors, from trade and transport to water management and space technology. Key announcements included the proposed “OTS PLUS” format to broaden partnerships beyond member states, Uzbekistan’s call for stronger defence cooperation and a permanent Secretariat for Economic Cooperation, and Kazakhstan’s invitation to collaborate on artificial intelligence initiatives. However, the summit rejected Turkey’s renewed attempt to turn the Turkish Republic of Northern Cyprus, recognised only by Ankara, into a full-fledged member. Go to accessibility shortcuts Share this article Read more Focus What went into creating Uzbekistan’s Center for Islamic Civilization? In partnership with Center of Islamic Civilization in Uzbekistan Focus Azerbaijan Investment Forum showcases new business opportunities In partnership with Azpromo Focus A new era for events at the Qatar Events Show In partnership with Media City Diplomacy Summit Business Asia Azerbaijan"
      },
      {
        "title": "Plasma resilience: Europe’s lifeline — and why we must strengthen it now",
        "link": "http://www.euronews.com/health/2025/10/15/plasma-resilience-europes-lifeline-and-why-we-must-strengthen-it-now",
        "timestamp": "2025-10-15T16:38:28.382856",
        "published": "2025-10-15T13:59:24",
        "summary": "When we think of medical breakthroughs, we rarely think of medicines made from human plasma. However, this golden, protein-rich liquid — accounting for 55% of our blood — is essential for the development of therapies for countless conditions, from rare inherited disorders to immunodeficiencies."
      },
      {
        "title": "Von der Leyen keeps the door open to EU enlargement on Western Balkans tour",
        "link": "http://www.euronews.com/2025/10/15/von-der-leyen-keeps-the-door-open-to-eu-enlargement-on-western-balkans-tour",
        "timestamp": "2025-10-15T16:38:28.382856",
        "published": "2025-10-15T13:59:01",
        "summary": "European Commission President Ursula von der Leyen visited Serbia on Wednesday, marking the fourth stop — after Albania, Montenegro and Bosnia and Herzegovina — of her tour across the Western Balkans to discuss EU enlargement with regional leaders. On Wednesday, von der Leyen met with Serbian President Aleksandar Vučić in Belgrade, where the two held a joint press conference. \"Nearly two decades ago, Serbia made the choice to join the EU — not as a strategic calculation, but as the heartfelt wish of the Serbian people,” von der Leyen said. Today Brussels expects Serbia to move twice as fast on its path toward full-fledged membership, von der Leyen added. “We live in a fragmented world where the gap between democracies and autocracies is widening,\" the Commission chief said. \"You know the EU’s position — our stance is for freedom, not repression, including the right to peaceful assembly. We stand for partnership instead of domination, and diplomacy instead of aggression.\" Von der Leyen further welcomed progress on voter registries and the appointment of the media regulator (REM) Council, acknowledging the efforts of civil society and the opposition. “This is a good first step,” she said, adding that implementation of reforms that will bring Serbia closer to the EU is crucial and inviting Vučić to Brussels “in a month’s time so that we can jointly assess the situation.” Von der Leyen also noted that Serbia needs to achieve a higher level of alignment with the EU’s foreign policy, including sanctions against Russia. “I must commend you, Serbia is already 61% aligned with our foreign policy, but more is needed. We must be able to count on Serbia as a reliable partner,” she said. Answering a question about ongoing student-led protests, nearing their one-year mark, von der Leyen said that this is a crucial moment for Serbia and a time for the entire nation to come together. “This is the moment to strengthen the foundations of a strong, vibrant, and effective democracy. I ..."
      },
      {
        "title": "EU vows to protect Spain from Trump's tariff 'punishment' over NATO spending",
        "link": "http://www.euronews.com/my-europe/2025/10/15/eu-vows-to-protect-spain-from-trumps-tariff-punishment-over-nato-spending",
        "timestamp": "2025-10-15T16:38:29.269414",
        "published": "2025-10-15T13:50:44",
        "summary": "Spain will be protected against any attempt by US President Donald Trump to impose punitive tariffs on the country in retaliation for its refusal to meet NATO's 5% target, the European Commission said on Wednesday, as the dispute over defence spending further interweaves with lingering trade tensions. All EU countries, including Spain, are bound by a common commercial policy, which means their products face the same tariffs when they are sold abroad. Technically speaking, it would be possible for the US to single out Spanish-made goods at customs and place them under a duty higher than the 15% rate currently in place. But for Brussels, which jealously guards its exclusive competence on trade, such discrimination would be anathema. \"We will respond appropriately, as we always do, to any measures taken against one or more of our member states,\" said Olof Gill, the Commission's spokesperson for trade. Gill did not specify which action Brussels could undertake in response to the \"hypothetical\" scenario. Instead, he called for dialogue to resolve any disagreement. \"We now have an EU-US trade deal in place. This is a platform for addressing any further trade-related questions,\" he added. The Commission's assurance came a day after Trump excoriated Spain's sluggish defence spending and raised the prospect of retribution through tariffs, an instrument that the Republican has deployed at large to advance his foreign policy goals. \"I think it's very disrespectful to NATO. In fact, I was thinking about giving them trade punishment through tariffs because of what they did. I may do that,\" Trump said, speaking to reporters in the White House. \"I think unbelievably disrespectful, Spain, the only one out of all the countries in NATO, the only (one) that said that is Spain. And I think they should be punished for that, yes.\" The friction between the US and Spain dates back to the NATO summit in June, when allies met in The Hague to agree on a new common commitment to devote 5% of t..."
      },
      {
        "title": "‘Immediate consequences’: How a US government shutdown could derail global climate progress",
        "link": "http://www.euronews.com/green/2025/10/15/immediate-consequences-how-a-us-government-shutdown-could-derail-global-climate-progress",
        "timestamp": "2025-10-15T16:38:30.351465",
        "published": "2025-10-15T13:04:29",
        "summary": "When the US government shut down two weeks ago, so did parts of its climate agenda. Thousands of federal workers have been sent home, billions in clean energy grants frozen and the country’s largest planned solar farm wiped from the government’s books. Analysts say the shutdown marks a slowdown in the nation’s already uncertain climate progress, but it also serves as a reminder that the world’s path to net zero can easily hinge on political whims – or even something as mundane as passing a budget. The Esmeralda 7, a collection of sevensolarfarms to be built on more than 25,000 hectares of federal land in the Nevada desert, was expected to generate up to 6.2 gigawatts of power, enough to supply two million homes. Under the Biden administration, it had become a symbol of the country’s ambition to modernise its energy mix amid rising demand from AI firms and fast-growing cities. But last week, after the federal governmentshut down, the US Bureau of Land Management (BLM) quietly changed the project’s status from “pending” to “cancelled” on its permitting website. The Interior Department denied Esmeralda 7 was cancelled. Instead, its spokespeople explained that contractors could re-bid for individual parts of the project. “During routine discussions prior to the lapse in appropriations, the proponents and BLM agreed to change their approach for the Esmeralda 7 Solar Project in Nevada,” an Interior Department spokesperson said in a statement. “The applicants will now have the option to submit individual project proposals to the BLM to more effectively analyse potential impacts.” The cancellation has drawn increasingly rare criticism from across the aisle in American politics. Nevada’s Democratic senators warned the decision would harm jobs and investment, while Utah’s Republican governor Spencer Cox said it would be “how [the US loses] the AI-energy arms race with China.” Environmentalists were divided. Some argued that the solar installations would threaten habitats for ..."
      },
      {
        "title": "Discover Kazakhstan’s Korgalzhyn Nature Reserve, a haven for thousands of flamingos",
        "link": "http://www.euronews.com/culture/2025/10/15/discover-kazakhstans-korgalzhyn-nature-reserve-a-haven-for-thousands-of-flamingos",
        "timestamp": "2025-10-15T16:38:30.868439",
        "published": "2025-10-15T13:00:53",
        "summary": "By Galiya Khassenkhanova Published on 15/10/2025 - 15:00 GMT+2 Share this article Share this article Facebook Twitter Flipboard Send Reddit Linkedin Messenger Telegram VK Bluesky Threads Whatsapp Copy/paste the article video embed link below: Copied A short trip from Astana, the Korgalzhyn State Nature Reserve is a pristine wildlife escape where visitors can observe majestic pink flamingos in their nesting grounds. ADVERTISEMENT Just two hours from Astana, the Korgalzhyn State Nature Reserve is Kazakhstan’s largest protected area and a UNESCO World Natural Heritage Site. Spanning over 543,000 hectares of wetlands, it shelters hundreds of bird and plant species, and serves as a vital stop for migratory routes. The reserve’s main attraction is its flamingos, which nest here in their thousands each spring, arriving at the northernmost point in their range. Safe from predators and sustained by brine shrimp in Lake Teniz, flamingos form unique “kindergartens” for their chicks and gradually turn pink from their diet. Korgalzhyn also draws thousands of eco-tourists each year from Europe and Asia. Beyond flamingos, visitors can encounter swans, saiga antelopes, and a pristine landscape that offers a rare glimpse of untouched Central Asian nature. Go to accessibility shortcuts Share this article Read more Modern Nomads Explore Katon Karagay, Central Asia’s remote paradise In partnership with MDQ Modern Nomads Kazakhstan plans immersive tourism at iconic Soviet-era spaceport In partnership with MDQ Modern Nomads Kazakhstan is changing how citizens think about environmental waste In partnership with MDQ Nature reserve Environmental protection Tourism Kazakhstan Animals Fauna and Flora"
      },
      {
        "title": "Serbia’s Hidden Gems: Springs, caves, waterfalls and spas await",
        "link": "http://www.euronews.com/travel/2025/10/15/serbias-hidden-gems-springs-caves-waterfalls-and-spas-await",
        "timestamp": "2025-10-15T16:38:31.375261",
        "published": "2025-10-15T13:00:38",
        "summary": "By Katherine Mendoza Malagon Published on 15/10/2025 - 15:00 GMT+2 Share this article Share this article Facebook Twitter Flipboard Send Reddit Linkedin Messenger Telegram VK Bluesky Threads Whatsapp Copy/paste the article video embed link below: Copied No sea? No problem. From waterfalls to lakes and spas, Serbia beckons with hidden treasures waiting to be explored. ADVERTISEMENT Nestled away in in Eastern Serbia, Krupajsko Vrelo is a natural spring whose clear waters form turquoise pools surrounded by untouched nature. Nearby, one of Serbia's oldest caves, Resavska Cave, reveals a labyrinth of stalactites and stalagmites sculpted over millions of years. In the heart of a hornbeam forest, Vrnjačka Banja's thermal waters provide a calm setting. Blending ancient spa traditions with the natural beauty of the area, it is a true escape into nature’s embrace. Go to accessibility shortcuts Share this article Read more Balkan Trip Serbia’s medieval gems: Manasija Monastery and Smederevo Fortress In partnership with Arena Channels Group Balkan Trip Exploring Serbia’s north: pumpkins, Palić lake, and Subotica’s charm In partnership with Arena Channels Group Balkan Trip Explore Serbia's red village of Donja Lokošnica and the Unesco-listed Pirot carpet craft In partnership with Arena Channels Group Tourism Balkans Serbia Travel"
      },
      {
        "title": "Iceland to ‘propose’ higher tourist tax following record-breaking number of visitors",
        "link": "http://www.euronews.com/travel/2025/10/15/iceland-to-propose-higher-tourist-tax-following-record-breaking-number-of-visitors",
        "timestamp": "2025-10-15T16:38:31.585174",
        "published": "2025-10-15T13:00:13",
        "summary": "Iceland is preparing for a huge tourism boom after witnessing a record-breaking number of visitors so far this year. Known as “the land of fire and ice”, the Nordic country has become famed for its geothermal hot springs, glaciers and waterfalls. It’s also one of the best destinations to spot the elusive Northern Lights, and holds year-round appeal thanks to non-stop sunlight in the summer. While some reports argue travellers are getting cold feet, it seems Iceland’s tourism sector is heating up. Despite claims thatIceland’s tourismbubble has “burst”, statistics shared with Euronews Travel show the country is on target for a record-breaking year of international visitors. Reports published earlier this week suggest that thecountryhas seen a six per cent drop in foreign tourists in the last year, citing a slump caused by Iceland’s high cost of living. However, data from Statistics Iceland show the number of foreign visitors increased by 2.2 per cent from 2023 to 2024, while the last 12 months to September 2025 have seen an additional 3.5 per cent spike. From January to August this year, Iceland has welcomed 1.792 million international visitors, an increase from 2024 (1.743 million) and a significant jump from 2019 (1.597 million). The first seven months of 2025 have also seen the largest number of booked rooms athotelsand B&Bs so far, while turnover in tourism-related sectors has been “especially high” from 2023 to 2025. The tourist boom has come to light in spite of several setbacks, including the closure of budget airline Play and the volcanic eruption at Sundhnúksgígar fissure. Jóhann Viðar Ívarsson, an analyst at Ferðamálastofa Icelandic Tourist Board, says cross-border tourist numbers have been increasing for decades internationally and that all forecasts assume that growth will continue - with the “dramatic exception” of the Covid pandemic. “Iceland is part of that,” he tells Euronews Travel. “The fact that growth has been considerably higher in Iceland than th..."
      },
      {
        "title": "Aid begins to enter Gaza as Israel limits deliveries over alleged Hamas truce violations",
        "link": "http://www.euronews.com/2025/10/15/aid-begins-to-enter-gaza-as-israel-limits-deliveries-over-alleged-hamas-truce-violations",
        "timestamp": "2025-10-15T16:38:31.723958",
        "published": "2025-10-15T12:59:01",
        "summary": "A convoy of trucks carrying food, fuel and medical supplies drove through the Rafah border crossing from Egypt into Gaza on Wednesday, according to the Egyptian Red Crescent. The entrance of humanitarian aid to the enclave was paused on Monday and Tuesday due to prisoner and hostage exchanges between Israel and Hamas and a Jewish holiday. The convoy of 400 trucks include 5,700 tonnes of food supplies and flour, more than 1,400 tonnes of medical supplies and equipment, and around 2,500 tonnes of fuel, the Egyptian humanitarian group said. State-run Egyptian broadcasters showed footage of the convoys as they passed through the crossing point. The trucks were headed for an Israeli inspection area in the Kerem Shalom crossing, before being allowed into the Gaza Strip. Under the first phase of the ceasefire deal, brokered by US President Donald Trump, which came into effect earlier this week, Israel was to permit the passage of 600 trucks carrying aid to Gaza daily, to match pre-war levels. The Israeli defence body overseeing the provision and distribution of humanitarian aid, COGAT, notified organisations responsible for providing aid that it would only permit half that amount in every day. It’s not immediately clear if COGAT was following through on threats made by Israel earlier to reduce the amount of aid trickling into the enclave. Israel had threatened to keep Rafah shut and reduce aid supplies as it accused Hamas of releasing the bodies of deceased hostages too slowly. The Trump-backed deal stipulated that the remains of the 28 dead hostages, along with the 20 living ones, were all to be released by Monday. COGAT has declined to comment on whether or not the reduced amounts of aid being permitted into the Palestinian territory is related to that, after being asked on the matter by the Associated Press. Humanitarian groups have called on Israel to immediately abide by the terms of the deal and allow entry of the agreed-upon 600 trucks a day to reach the Strip's 2 m..."
      }
    ],
    "scraped_count": 12,
    "format": "rss",
    "feed_title": "Latest News From Euronews | Euronews RSS"
  },
  {
    "source": "Politico Europe",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "Orbán rival Magyar accuses Várhelyi of ‘not revealing whole truth’ in Hungarian spy affair",
        "link": "https://www.politico.eu/article/viktor-orban-rival-peter-magyar-accuses-oliver-varhelyi-hungarian-spy-affair/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:27.335624",
        "published": "2025-10-15T14:37:10",
        "summary": "Viktor Orbán’s rival Péter Magyar has accused Hungarian Commissioner Oliver Várhelyi of holding back information about his time as an ambassador during a period when a spy ring is alleged to have operated out of his office. Reports last week by several media outlets alleged that Hungarian intelligence officials disguised as diplomats had tried to recruit European Union staffers as spies during Várhelyi’s time as Hungary’s envoy to Brussels. EU Health Commissioner Várhelyi told European Commission President Ursula von der Leyen over the weekend that he was “not aware” of alleged efforts by Orbán’s government to recruit spies in Brussels, according to a Commission spokesperson. The Commission said last week it would probe the allegations . Advertisement But Magyar, who holds a sharp lead on Orbán in current polling ahead of April’s parliamentary election, wrote in a Facebook post : “In my opinion, Olivér Várhelyi, the current EU Commissioner and former EU Ambassador (and my former boss), did not reveal the whole truth when he denied this during the official investigation the other day.” Várhelyi served as ambassador to Hungary’s permanent representation to the EU between 2015 and 2019, having previously worked as the deputy ambassador from 2011. Magyar worked at the permanent representation office in Brussels between 2011 and 2015. POLITICO contacted several members of Commissioner Várhelyi’s team about Magyar’s allegations, but did not receive a response. Magyar also named Hungarian government minister János Lázár in his Facebook post, writing it was \"a common fact\" that secret service people were deployed to Brussels during Lázár's time overseeing EU affairs from 2012 to 2018. Lázár did not respond to POLITICO's request for comment on Magyar's post, but was quoted in the Hungarian press this week as saying: \"I don’t recall the exact details — I’m not great at remembering — but my duty is to protect my country.\" \"If Hungarian intelligence had gone to Brussels ... I w..."
      },
      {
        "title": "Update: Nina Warkens Gesundheitssparkurs und Wehrdienstreform",
        "link": "https://www.politico.eu/podcast/berlin-playbook-podcast/update-nina-warkens-gesundheitssparkurs-und-wehrdienstreform/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:27.620279",
        "published": "2025-10-15T14:16:45",
        "summary": "Gesundheitsministerin Nina Warken legt ihr erstes großes Sparpaket vor und will damit das drohende Zwei-Milliarden-Defizit in der gesetzlichen Krankenversicherung verhindern. Im Update erklärt Jürgen Klöckner, wie Kliniken besonders betroffen sind, warum CSU-Politiker Klaus Holetschek und Landkreistagspräsident Achim Brötel gegen die Kürzungen keilen.&#160; Außerdem: Der neue Ärger um den Wehrdienstkompromiss. Nach parteiinternen Spannungen hält SPD-Verteidigungsminister Boris [&#8230;]"
      },
      {
        "title": "US State Department revokes visa of German over Charlie Kirk criticism",
        "link": "https://www.politico.com/news/2025/10/15/state-department-visas-revoked-charlie-kirk-criticism-00608817?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:27.620279",
        "published": "2025-10-15T13:14:37",
        "summary": "The department did not identify the visa holders by name or specify what type of visas were revoked."
      },
      {
        "title": "Von der Leyen’s party threatens to reject EU budget proposal in November",
        "link": "https://www.politico.eu/article/ursula-von-der-leyen-party-epp-threaten-reject-eu-budget-proposal-november/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:28.776912",
        "published": "2025-10-15T12:45:57",
        "summary": "BRUSSELS — The largest group in the European Parliament is threatening to reject a key part of the European Commission’s multiyear budget proposal in November. In a major confrontation, the European People’s Party (EPP) — from which Commission President Ursula von der Leyen and most of her commissioners hail — renewed a threat to refuse to support the proposal if it doesn’t get major concessions on money for farmers and Europe's regions. “If the Commission ignores our demands, our members see a rejection as unavoidable,” said Siegfried Mureșan, the EPP’s lead negotiator on the next multiannual financial framework (MFF). He added that the EPP \"expects\" serious concessions from the Commission \"by November.\" Advertisement “A rejection can only be avoided if the Commission improves its proposal shortly. No option is off the table,\" Mureșan added in a written statement. The EPP is turning the screws on the Commission after days of meetings with commissioners in charge of the budget that were described by party insiders as unproductive. If the standoff continues, the European Parliament could put forward a motion to reject the proposal during a plenary session in Brussels on Nov. 12. Such a move would likely receive the backing of most political groups. The Commission could theoretically ignore the Parliament's vote — but that might spell trouble further down the line, given that Parliament’s consent is needed to approve the next seven-year budget, which covers the years 2028 to 2034. To allow more time for negotiations, the EPP walked back from a previous threat to put forward a motion against the Commission proposal during next week's plenary session in Strasbourg. Under heavy pressure from farmers and mayors, the EPP has demanded changes to a controversial plan to pool funds for farmers and regions — which make up over half of the total EU budget — into single pots managed by national governments. “I had meetings with [Agriculture] Commissioner [Christophe] Hansen … we..."
      },
      {
        "title": "PMQs: Starmer tied in knots over collapsed China spy case",
        "link": "https://www.politico.eu/article/pmqs-keir-starmer-china-spy-case/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:29.142322",
        "published": "2025-10-15T12:21:48",
        "summary": "Prime minister’s questions: a shouty, jeery, very occasionally useful advert for British politics. Here’s what you need to know from the latest session in POLITICO’s weekly run-through . What they sparred about: The collapsed China spy case, of course. Parliament’s security was at the front of MPs’ minds in the first joust between Prime Minister Keir Starmer and Tory Leader Kemi Badenoch since recess. They argued over who, exactly, should be blamed for the case not reaching trial. If you’ve had a news holiday: The criminal case against Christopher Cash and Christopher Berry, who were accused of spying for Beijing, fell apart last month after the Crown Prosecution Service (CPS) said the government provided insufficient evidence proving China was a threat to national security. Both men denied the charges, while Labour and the Tories had a predictable back-and-forth about who held responsibility. Advertisement But first: The PM made a statement before Badenoch even had a chance to lay a blow, to some consternation from Tory MPs. Starmer reiterated he was “deeply disappointed” the case failed and ripped into “baseless accusations” from the Tories. The PM said that government policy under the Conservatives (when the alleged offenses took place) did not “describe China as an enemy,” which meant the prosecution test couldn’t be met. Powells apart: National Security Adviser Jonathan Powell’s role came under intense scrutiny — but Starmer insisted “no minister or special adviser” played any role in the provision of evidence. In a clear news line, the PM said he would publish witness statements that were being checked over. No surprise: Badenoch wasn’t happy. The Tory leader said Starmer’s spiel “answers no questions” and offered “only more obfuscation.” Calling the trial collapse “simply unbelievable,” Badenoch ran through quotes where the Tories were less than pally with Beijing ( just don’t mention that pint ). The PM, natch, threw those remarks back in her face, quoting h..."
      },
      {
        "title": "Keir Starmer commits to publishing statements in collapsed China spy trial",
        "link": "https://www.politico.eu/article/keir-starmer-commits-to-publishing-statements-in-collapsed-china-spy-trial/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:29.541910",
        "published": "2025-10-15T12:01:04",
        "summary": "LONDON — Keir Starmer has promised to publish government witness statements provided to prosecutors handling the collapsed case of two men accused of spying for China. The U.K. prime minister told MPs on Wednesday there would be a “short process” before the statements are published in full. Starmer’s government has been under pressure to explain its role in compiling evidence, after Director of Public Prosecutions Stephen Parkinson stated that the case against the two men had imploded because the government refused to label Beijing a “threat to the national security of the U.K.” Advertisement Christopher Cash, 30, a former researcher for a Conservative MP, and Christopher Berry, a 33-year-old teacher, were due to face trial this month on charges of breaching the Official Secrets Act between December 2021 and February 2023, for allegedly spying for China, which they have strongly denied. The charges were dropped last month after the Crown Prosecution Service said the “evidential standard for the offence indicted is no longer met.” Conservative Leader Kemi Badenoch has repeatedly questioned how the government failed to produce the evidence needed for the CPS. She accused Starmer of a “cover-up” during weekly questions to the PM. Prosecutors had previously been satisfied with a decision to press charges based on where the law stood at the time, she said. The government has repeatedly blamed the previous Conservative government’s stance on China – refusing to designate it as a threat to national security – for the collapse of the case because that was when the offenses were allegedly committed. Starmer insisted in parliament that “no minister was involved, no special adviser was involved in this.”"
      },
      {
        "title": "MEP targeted by spyware files complaint against Hungary’s Viktor Orbán",
        "link": "https://www.politico.eu/article/spyware-targeted-mep-sues-hungarys-viktor-orban/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:29.919656",
        "published": "2025-10-15T11:54:56",
        "summary": "BERLIN — One of Hungary’s most outspoken critics in Brussels has filed a criminal complaint against Hungarian Prime Minister Viktor Orbán following a failed attempt to hack his email account using spyware in the run-up to the European Parliament elections. German Green MEP Daniel Freund and German NGO the Society for Civil Rights named “Viktor Orbán and unknown” in the complaint, which was seen by POLITICO, and requested that the state prosecutor in the western German city of Krefeld and cyber crime authorities launch an investigation. “There are indications that the Hungarian secret service is behind the attack,” Freund and the NGO said in a joint statement on Wednesday. Advertisement The complaint gives details about an email that someone claiming to be a Ukrainian student sent to Freund’s parliamentary email address at the end of May 2024. The message asked the MEP to write a short message in which he would share his “beliefs concerning the accession of Ukraine to the European Union,” as well as a link. Freund did not click on the link. The complaint said that Parliament warned Freund that the link contained spyware likely made by the Israeli company Candiru, which was blacklisted by the U.S. government in 2021 for human rights violations. “According to the EU Parliament’s IT experts, the Hungarian government could be behind the eavesdropping on me,” Freund said in a statement. “This comes as no surprise: Orbán despises democracy and the rule of law. If the suspicion is confirmed, it would be an outrageous attack on the European Parliament.” Freund and the NGO asked prosecutors to open an investigation to clarify “the facts of the case” through investigative measures including the questioning of witnesses and conducting an independent forensic analysis. The Hungarian government had not responded to a request for comment at the time of publication. If a device is infected with spyware, attackers can access all stored data and communications. They can also activate..."
      },
      {
        "title": "Von der Leyen warns Serbia: Time to get real about joining the EU",
        "link": "https://www.politico.eu/article/time-get-concrete-about-serbia-joining-eu-ursula-von-der-leyen-tells-aleksandar-vucic/?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
        "timestamp": "2025-10-15T16:38:30.258144",
        "published": "2025-10-15T11:51:20",
        "summary": "European Commission President Ursula von der Leyen delivered pointed remarks Wednesday to Serbian President Aleksandar Vučić about his country’s progress toward EU membership. “Now is the moment for Serbia to get concrete about joining our union,” said the Commission chief, during a press conference in Belgrade on her tour of the Western Balkans. “Therefore, we need to see progress, on the rule of law, the electoral framework and media freedom,” von der Leyen added. Advertisement “I know these reforms are not easy,” she said. “They take patience and endurance. They must include all parts of society and the political spectrum. But they are worth the effort. Because they move you closer to your goal.” Von der Leyen also urged the Serbian president to join the EU in imposing sanctions against Russia. Belgrade has consistently refused to align with the bloc in sanctioning Russian energy and goods, especially since it is almost entirely dependent on Russian gas. “I commend you for reaching 61 percent of alignment with our foreign policy. But more is needed. We want to count on Serbia as a reliable partner,” said von der Leyen. Serbia applied for EU membership in 2009 and was subsequently granted candidate status in 2012, later opening accession negotiations with the EU in 2013. Since then, 22 of the 35 chapters of accession criteria have been opened — but only two have been provisionally closed. Leadership in the Western Balkan country has come under heavy criticism in recent years. Protests triggered by the collapse of the Novi Sad train station canopy in November last year turned into a wider revolt over corruption, accountability, and democratic backsliding, which was met with a violent response from police. The European Green Party criticized the Commission chief’s visit to Serbia, calling it “deeply regrettable that von der Leyen honors Vučić with an official visit without visible reservations, while his regime unlawfully detains students and opposition members and ..."
      }
    ],
    "scraped_count": 8,
    "format": "rss",
    "feed_title": "POLITICO"
  },
  {
    "source": "Deutsche Welle",
    "type": "news",
    "priority": 3,
    "items": [
      {
        "title": "Syria's new leader visits Moscow for talks with Putin",
        "link": "https://www.dw.com/en/syria-s-new-leader-visits-moscow-for-talks-with-putin/a-74369742?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:26.475792",
        "summary": "Syria's president is visiting Russia seeking to reset ties after the fall of long-time ruler Bashar al-Assad. Moscow had been the main ally of the dictator whose regime was toppled by Ahmed al-Sharaa's alliance."
      },
      {
        "title": "Pakistan: Fresh clashes on Afghan border leave several dead",
        "link": "https://www.dw.com/en/pakistan-fresh-clashes-on-afghan-border-leave-several-dead/a-74364795?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:26.475792",
        "summary": "https://p.dw.com/p/521gB Pakistan has accused Afghanistan of opening \"unprovoked fire\" Image: Sanaullah Seiam/AFP Advertisement New clashes erupted early on Wednesday between Pakistani and Afghan forces at the joint border, with both sides accusing the other of having begun the hostilities. The fighting comes amid tensions caused by Pakistani accusations that Afghanistan is harboring anti-Pakistan militants, with Islamabad calling on the Afghan Taliban administration to take action against them. The Taliban rulers of Afghanistan, for their part, deny that such militants are sheltering in their country. Afghanistan has made similar accusations against Pakistan. What sparked the fighting? According to the Pakistani military's media wing, the Inter-Services Public Relations (ISPR), the \"Afghan Taliban resorted to cowardly attacks at four locations in Spin Boldak area of Balochistan.\" The ISPR said that fighters from the Afghan Taliban and from Tehreek-e-Taliban Pakistan (TTP) were both involved in the attacks. It said at least 20 fighters were killed and many wounded on Afghan side. Tensions flare at Afghan-Pakistan border To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video The ISPR said a similar attack was repulsed in the northwestern province of Khyber Pakhtunkhwa's Kurram region overnight, with at least 30 Afghan Taliban and TTP fighters \"suspected to have been killed.\" Afghanistan's Taliban government spokesman Zabihullah Mujahid in his turn accused Pakistan of launching the attack in Spin Boldak. He said 12 civilians were killed and more than 100 were wounded in the fighting. Mujahid said Afghan forces had been \"compelled to retaliate\" to shelling and gunfire from Pakistani forces, \"resulting in the elimination of several Pakistani attackers, the seizure of their outposts and bases, the confiscation of weapons and tanks, and the destruction of significant military infrastructure.\" Ongoing skirmishes at Af..."
      },
      {
        "title": "Kenya's opposition giant Raila Odinga dies aged 80",
        "link": "https://www.dw.com/en/kenya-s-opposition-giant-raila-odinga-dies-aged-80/a-74364791?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:27.447188",
        "summary": "Raila Amolo Odinga, arguably the face of Kenya's opposition for more than three decades, has died in India aged 80. A seven-day mourning period has been declared, and Odinga will be honored with a state funeral."
      },
      {
        "title": "Major US news outlets reject Pentagon's new press rules",
        "link": "https://www.dw.com/en/major-us-news-outlets-reject-pentagon-s-new-press-rules/a-74358548?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:27.447188",
        "summary": "https://p.dw.com/p/5203Q A series of actions have been taken under Pete Hegseth to restrict access to information from the Pentagon Image: Julia Demaree Nikhinson/AP Photo/picture alliance Advertisement Several US and international news organizations on Tuesday refused to sign the new rules proposed by the Pentagon for media access. At least 30 news outlets, including the New York Times , the Associated Press, Reuters, AFP and Fox News, rejected the Pentagon's new media policy, saying that it violates the constitutionally protected right to free speech. The Pentagon had warned that it would revoke press badges for news organizations that did not agree with the media access rules. Why are news outlets objecting to the new policy? Under the new policy, journalists have to acknowledge that they could be deemed security risks and have their Pentagon press badges revoked if they ask department employees to disclose classified and some types of unclassified information. The new rules come after the Department of Defense has already restricted media access inside the Pentagon, forced some outlets to vacate offices in the building, and reduced the number of press briefings. Chief Pentagon spokesperson Sean Parnell said in a statement on Monday: \"The policy does not ask for them to agree, just to acknowledge that they understand what our policy is.\" Pentagon chief Pete Hegseth called the requirements \"common sense,\" adding that \"we're trying to make sure national security is respected.\" What are the news organizations saying? The Pentagon Press Association (PPA) said, the media policy \"gags Pentagon employees\" by threatening retaliation against reporters who seek out information that has not been pre-approved for release. Trump to rebrand Defense Department To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video Major broadcasting networks ABC , CBS , CNN, Fox News and NBC issued a joint statement saying they will not si..."
      },
      {
        "title": "Charlie Kirk: US revokes 6 visas over social media comments",
        "link": "https://www.dw.com/en/charlie-kirk-us-revokes-6-visas-over-social-media-comments/a-74358427?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:28.414488",
        "summary": "https://p.dw.com/p/5201T The US State Department said it had revoked 6 visas over social media comments on the assassination of Charlie Kirk [pictured] Image: Ross D. Franklin/AP Photo/dpa/picture alliance Advertisement The US State Department on Tuesday revoked six visas over social media comments on the assassination of right-wing activist Charlie Kirk . Kirk was shot dead when speaking at a rally at a Utah university in September. The suspect in the assassination faces the death penalty if convicted . The announcement comes as President Donald Trump posthumously awarded Kirk with a Presidential Medal of Freedom. What do we know about the revoked visas? The State Department said those whose visas were revoked were citizens of Argentina, South Africa, Mexico, Brazil, Germany and Paraguay. \"The United States has no obligation to host foreigners who wish death on Americans,\" the department said in a post on X. \"Aliens who take advantage of America's hospitality while celebrating the assassination of our citizens will be removed,\" it added. The State Department said it was continuing to identify visa holders who it believes celebrated Kirk's assassination. Trump awarded Kirk with the US' highest civilian honor Image: Andrew Caballero-Reynolds/AFP The Trump administration has cracked down on immigration since he took office in January, increasing social media vetting and revoking thousands of visas. In August, the Trump administration said that it would include \"anti-American activity\" and antisemitism in immigration screening . Kirk 'martyr for truth and freedom' — Trump Also on Tuesday, Trump described Kirk as a \"martyr for truth and freedom\" as he posthumously awarded him with the Presidential Medal of Freedom. He handed the award to Kirk's widow, Erika Kirk . \"In the wake of Charlie's assassination, our country must have absolutely no tolerance for this radical left violence, extremism and terror,\" Trump said. Erika Kirk said her husband 'would probably have run fo..."
      },
      {
        "title": "Nord Stream attack: Polish PM Tusk against extradition to Germany",
        "link": "https://www.dw.com/en/nord-stream-attack-polish-pm-tusk-against-extradition-to-germany/a-74352399?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:28.808714",
        "summary": "Poland considers the bombing of the Nord Stream Baltic Sea pipeline a heroic act. The alleged and arrested Ukrainian accomplice Volodymyr Z., will likely not be extradited to Germany for geopolitical reasons."
      },
      {
        "title": "What role can Europe play in Trump's peace plan?",
        "link": "https://www.dw.com/en/what-role-can-europe-play-in-trump-s-peace-plan/a-74352201?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:28.808714",
        "summary": "https://p.dw.com/p/51yP3 European leaders attended the summit in Egypt — but will they have much of a say in Gaza's future? Image: Yoan Valat/REUTERS Advertisement As the Israel–Gaza ceasefire took effect and US President Donald Trump declared peace, Europe found itself sidelined. While key European leaders attended the summit in Sharm el-Sheikh, Egypt — where Trump’s 20-point peace plan was signed by mostly Arab and Muslim countries — they played a minimal role in the negotiations. Experts said the bloc wants to play a bigger role in shaping the future of Gaza and resolving the conflict. But, with the exception of former British Prime Minister Tony Blair no other names have yet been announced as members of the so–called Board of Peace that will be led by Trump. The EU is the biggest aid provider to the Palestinian Authority (PA) Image: Stringer/REUTERS Will Europe get involved beyond offering aid? The EU has voiced its intention to provide funds for Gaza's reconstruction, which initial estimates suggest will cost more than $50 billion (€42 billion). \"We will be an active force within the Palestinian Donors Group,\" EU Commission President Ursula von der Leyen, posted on X. \"And we will provide EU funding for the reconstruction of Gaza.\" President of the European Council, Antonio Costa, represented the bloc in Egypt. He took the opportunity to outline its willingness to move beyond aid, saying the EU stands \"ready to contribute\" to the next steps in Trump's plan for a temporary transitional governance by a technocratic, apolitical Palestinian committee. Europe is already the biggest donor to the Palestinian Authority (PA) which governs the West Bank. As well as assisting the reconstruction of Gaza, Costa also said that the EU would contribute to the security. Trump's plan envisages an International Stabilization Force (ISF) to be set up in coordination between the US, Arab and other international partners to be deployed in Gaza. Will Europe send forces to Gaza as par..."
      },
      {
        "title": "India's cough syrup tragedy shows huge drug safety gaps",
        "link": "https://www.dw.com/en/india-s-cough-syrup-tragedy-shows-huge-drug-safety-gaps/a-74352862?maca=en-rss-en-world-4025-rdf",
        "timestamp": "2025-10-15T16:38:29.872393",
        "summary": "The poisoning of children in Madhya Pradesh state has sparked urgent calls to reform India's massive pharmaceutical industry, which produces most of the world's vaccines and a large share of its generic medications."
      }
    ],
    "scraped_count": 8,
    "format": "rss",
    "feed_title": "World | Deutsche Welle"
  },
  {
    "source": "Computer Sweden",
    "type": "tech",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Computer Sweden"
  },
  {
    "source": "Ny Teknik",
    "type": "tech",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Ny Teknik"
  },
  {
    "source": "Breakit Tech",
    "type": "tech",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Breakit Tech"
  },
  {
    "source": "SMHI Väder",
    "type": "weather",
    "priority": 3,
    "items": [
      {
        "description": "Stockholm: ⛅️  +9°C 93% ↘8km/h",
        "temperature": "+9°C",
        "location": "Stockholm",
        "timestamp": "2025-10-15T16:38:35.620050",
        "raw_content": "Stockholm: ⛅️  +9°C 93% ↘8km/h",
        "format": "wttr_plain"
      }
    ],
    "scraped_count": 1,
    "format": "html"
  },
  {
    "source": "NWT - Nya Wermlands-Tidningen",
    "type": "news",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "NWT - Nya Wermlands-Tidningen"
  },
  {
    "source": "Miljö & Utveckling",
    "type": "climate",
    "priority": 3,
    "items": [
      {
        "title": "Jörgen Warborns omnibus får grönt ljus – nu väntar förhandlingar",
        "link": "https://miljo-utveckling.se/jorgen-warborns-omnibus-far-gront-ljus-nu-vantar-forhandlingar/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T09:30:48",
        "summary": "EU-parlamentets rättsliga utskott har sagt ja till Jörgen Warborns (M) omnibusförslag. Beslutet banar väg för nya gränser i CSRD och CSDDD – och tar EU ett steg närmare en uppgörelse om företagens hållbarhetsansvar."
      },
      {
        "title": "“Vi lever i början av en infocalypse” – därför måste företag börja arbeta med framsyn",
        "link": "https://miljo-utveckling.se/vi-lever-i-borjan-av-en-infocalypse-darfor-maste-foretag-borja-arbeta-med-framsyn/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T08:33:58",
        "summary": "När förändringstakten skenar räcker inte trendspaning längre, menar framtidsstrategen Fredrika Yngwe. Med strategisk framsyn kan företag upptäcka tidiga signaler – och agera innan förändringen slår till."
      },
      {
        "title": "Experterna listar: Här är kompetenskraven på hållbarhetschefen 2026",
        "link": "https://miljo-utveckling.se/karriar-experterna-listar-har-ar-kompetenskraven-pa-hallbarhetschefen-2026/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T08:29:23",
        "summary": "Vilka kompetenser krävs för framtidens hållbarhetschef? När hållbarhetsfrågorna blir alltmer affärskritiska förändras också kraven på den som leder arbetet. Från cirkuläritet och demokrati till data, strategi och varumärkesbyggande – experterna ser tydliga skiften inför 2026."
      },
      {
        "title": "Företag uppmanas till klimatpress – här är fem krav inför Cop30",
        "link": "https://miljo-utveckling.se/foretag-uppmanas-till-klimatpress-har-ar-fem-krav-infor-cop30/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T09:46:02",
        "summary": "Inför klimatmötet Cop30 i Brasilien lanseras ett nytt verktyg för att hjälpa företag driva på politiken för klimat och biologisk mångfald. Fem tydliga krav ska sätta press på världens regeringar – och visa att näringslivet vill mer."
      },
      {
        "title": "Forskare: Världens korallrev nära kritisk gräns – men ännu inte bortom räddning",
        "link": "https://miljo-utveckling.se/forskare-varldens-korallrev-nara-kritisk-grans-men-annu-inte-bortom-raddning/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-14T15:19:48",
        "summary": "Korallrev är på väg att dö ut om utsläppen fortsätter som nu, enligt en ny rapport – men det finns fortfarande rev att kämpa för. Det understryker Fredrik Moberg, som är biolog och forskare på Stockholm Resilience Centre vid Stockholms universitet, i efterdyningarna av rapporten ”The Global tipping points report”. \n– Egentligen är det inte kört, bara ett ytterst allvarligt läge, säger Fredrik Moberg."
      },
      {
        "title": "Riksrevisionen: Bristfälligt statligt stöd för jordbrukets omställning",
        "link": "https://miljo-utveckling.se/politik-riksrevisionen-bristfalligt-statligt-stod-for-jordbrukets-omstallning/",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-14T12:03:31",
        "summary": "Riksrevisionen: Bristfälligt statligt stöd för jordbrukets omställning Politik Statens klimatarbete får kritik av Riksrevisionen för brister inom jordbruket gällande både räckvidd och långsiktig styrning. Riksrevisionen pekar nu ut vad som behöver förändras. 14 oktober 2025 Ellen Sundström Foto: Adobe Stock. Riksrevisionen har granskat statens insatser för att minska jordbrukets växthusgasutsläpp. Granskningen visar att befintliga stöd, som Klimatklivet, gödselgasstödet, ersättningar för odling av fånggrödor samt rådgivning till jordbrukare, är effektivt utformade men har begränsad räckvidd. Tillsammans täcker de endast en mindre del av jordbrukets totala utsläpp. Någonting är fel Du är inloggad som prenumerant hos förlaget Pauser Media, men nånting är fel. På din profilsida ser du vilka av våra produkter som du har tillgång till. Skulle uppgifterna inte stämma på din profilsida – vänligen kontakta vår kundtjänst. Miljö & Utveckling premium Läs vidare – starta din prenumeration Magasinet Miljö & Utveckling - 6 nummer per år Full tillgång till allt digitalt material Prenumerera Redan prenumerant? Logga in och läs vidare. En central slutsats i rapporten är att regeringens styrning är otillräcklig för att jordbruket ska kunna bidra till att uppnå Sveriges klimatmål. Det saknas en övergripande plan för hur jordbrukets utsläpp ska minska, och flera kostnadseffektiva åtgärder har ännu inte omfattats av styrmedel. Det gäller till exempel återvätning av organogen jordbruksmark, beskogning av nedlagd mark och användning av metanreducerande fodertillsatser. bz0WhrI0+1qCJ1kh6bKBvQqeGqJDBUzD2IHb0LCmtbrDS+TuCFHknGIj+6SRCJwOWFrpxgwIB2X4jxumub4DORQ779dhB16p71hCJy0ZtmDBVT6tTu4aHJrqPSRVJrawq1mhwhWXx0q1bdOPP98FCxuT8nbcYvTZT8WTwEUbTCPP/MO28LChHSzSDtTvy3q7RINXZRvOTajQfiL830sGOq044/FCvdXkzSwMs+yAJtEZSLVw6vZKXLASZ47fqGi8fZoXjGB66r8lGPonJ+17IAL/PVEyOkMJnqQw4lamPBmxbfdDRwgLUJfgpjjA4AK6Fw1YJutHOFXQHDjlIG5zTfYzKrchjpujXnMZHMGu+S8aODbJPWaHUf8Ahx7b8K2o3R0M1nhlvyxMDd59/SchEk2m7VC5lK+tNdLvewKdJl..."
      }
    ],
    "scraped_count": 6,
    "format": "rss",
    "feed_title": "Miljö & Utveckling"
  },
  {
    "source": "Naturskyddsföreningen",
    "type": "climate",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Naturskyddsföreningen"
  },
  {
    "source": "TechCrunch",
    "type": "tech",
    "priority": 3,
    "items": [
      {
        "title": "Less than 3 days remain to secure your exhibit table at TechCrunch Disrupt 2025",
        "link": "https://techcrunch.com/2025/10/15/less-than-3-days-remain-to-secure-your-exhibit-table-at-techcrunch-disrupt-2025/",
        "timestamp": "2025-10-15T16:38:26.406935",
        "published": "2025-10-15T14:30:00",
        "summary": "TechCrunch Disrupt 2025 runs October 27-29 in San Francisco’s Moscone West, and the Expo Hall is filling up fast. With just three days left to book, now is the moment to reserve your exhibit table before a competitor takes it. This is your opportunity to showcase your innovation to investors, founders, media, and tech leaders who are actively seeking the next big idea, investment, or solution. The bustling Expo Hall is where all of Disrupt’s foot traffic converges — and that’s exactly where you’ll be. Register now before October 17, 11:59 p.m. PT, and learn more about how an exhibit table boosts your brand. Image Credits: Eric Slomonson, The Photo Group Exclusive perks for exhibitors Lead generation through the Disrupt mobile app to connect with qualified attendees instantly Complimentary partner Wi-Fi network to keep your team connected Silver Tier sponsor recognition for maximum visibility Access to the TechCrunch Disrupt press list to amplify your story 10 comped passes for your team to network, attend sessions, and meet key players Branding on the website, app, on-site signage, and more to elevate your presence Don’t miss your brand spotlight TechCrunch Disrupt is where startups launch, deals are made, and industry-defining conversations happen. Tables are going fast, and the spot you want might not be available for long. Reserve your table now before the October 17th booking deadline. Image Credits: Halo Creative Topics AI , Biotech & Health , Fintech , Fundraising , Robotics , Space , Startups , TC , TechCrunch Disrupt 2025 , Venture TechCrunch Events View Bio October 27-29, 2025 San Francisco FLASH SALE ALERT: Register by Oct 17 and save up to $624 (or up to 30% on groups). Get the ticket type for you: Founders: Your next big connection and investor are here . Investors: Meet startups that align with your investment goals. Innovators & Visionaries: See the future of tech before everyone else. S ave Now Most Popular Nvidia’s AI empire: A look at its top startu..."
      },
      {
        "title": "You can now text Spotify’s AI DJ",
        "link": "https://techcrunch.com/2025/10/15/you-can-now-text-spotifys-ai-dj/",
        "timestamp": "2025-10-15T16:38:26.639655",
        "published": "2025-10-15T14:17:28",
        "summary": "Spotify on Wednesdayupgradedits AI DJ feature — available to Premium subscribers — with a handful of new features, including the ability to send in your requests by typing, not just using voice commands. The feature works with both English and Spanish requests, as Spotify’sSpanish-language DJ, called DJ Livi, now accepts music requests. The AI DJ feature was updatedearlier this year to accept voice requests, instead of only playing tunes Spotify thinks that you’ll like. However, that feature was only available to the English-language AI DJ until today. Texting with an AI assistant is now a common behavior, thanks to the rising popularity of AI chatbots like ChatGPT and Gemini. These services allow for multi-modal inputs, meaning you can either talk, text, or upload images and files as part of your request. As more people have gotten used to shifting back and forth between input methods, Apple rolled out a version of its Siri assistant that can also be reached by text. It’s a natural next step for Spotify’s AI feature to accept text input, as well, given that users are often engaged with the streaming service when out and about, commuting, or in a quiet space where they don’t want to disturb others by issuing voice commands. In addition to the new texting feature, Spotify says that the AI DJ will also now offer personalized prompt suggestions to help inspire you if you’re not sure what you want to listen to next. To access the DJ, you simply search for the term “DJ” on Spotify and then press play to start your curated selection of music. If you want to change the music, you can tap the DJ button in the bottom-right of the screen, then offer your suggestion via voice or text. Spotify notes the DJ can handle requests that combine genre, mood, artist, or activity. The feature is currently live in English and Spanish in over 60 markets worldwide. FLASH SALE ALERT:Register byOct 17andsave up to $624(or up to 30% on groups).Get the ticket type for you:Founders:Your next bi..."
      },
      {
        "title": "3 days left: Save up to $624 on your TechCrunch Disrupt 2025 Pass before prices rise",
        "link": "https://techcrunch.com/2025/10/15/3-days-left-save-up-to-624-on-your-techcrunch-disrupt-2025-pass-before-prices-rise/",
        "timestamp": "2025-10-15T16:38:26.767292",
        "published": "2025-10-15T14:00:00",
        "summary": "Only 3 days left to save up to $624 on your TechCrunch Disrupt 2025 pass before prices rise Friday, October 17 at 11:59 p.m. PT. Join 10,000+ founders, investors, and operators for 200+ sessions, 250+ speakers, and Startup Battlefield 200. Register now to save up to $624, or save 15% to 30% on group passes."
      },
      {
        "title": "VSCO gets AI editing chops, support for RAW files",
        "link": "https://techcrunch.com/2025/10/15/vsco-gets-ai-editing-chops-support-for-raw-files/",
        "timestamp": "2025-10-15T16:38:26.767292",
        "published": "2025-10-15T12:06:29",
        "summary": "Video editing app VSCO is adding a set of new AI image editing tools, support for high-resolution RAW files, non-destructive edits, and content-aware region detection. The AI tools will be housed in a new tab called “AI Labs,” which also brings AI-powered object removal chops, similar to Google and Apple’s homegrown offerings. You can highlight or draw a circle around an object in a picture, and VSCO will replace it with what it thinks matches the background. The company said it uses “intelligent area detection” to blend the background in after an object is removed without affecting the resolution or color. Unlike most AI-powered removal tools that leave artifacts at times, VSCO claims its tool is more precise and preserves details, and is therefore better suited for professional photographers. VSCO’s new AI-powered image removal tool Image Credits: VSCO The company said that it will soon launch another AI-powered feature called Upscale, which claims to increase the resolution of images and sharpen details without compromising on details or composition. VSCO is using Black Forest Labs’ FLUX.1 Kontext model to power these features. The AI Labs features are available on VSCO’s Pro tier, which costs $12.99 a month, or $60 a year, on the VSCO Studio app on iOS. The company is not setting a limit on the number of times users can use AI Labs features. Techcrunch event DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, Vinod Khosla — some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Grab your ticket before Oct 17 to save up to $624. DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, Vinod Khosla — some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Grab you..."
      },
      {
        "title": "Waymo plans to launch a robotaxi service in London in 2026",
        "link": "https://techcrunch.com/2025/10/15/waymo-plans-to-launch-a-robotaxi-service-in-london-in-2026/",
        "timestamp": "2025-10-15T16:38:27.115305",
        "published": "2025-10-15T09:00:00",
        "summary": "Waymo said on Wednesday it will offer a commercial robotaxi service in London in 2026, marking the Alphabet-owned company’s second international expansion following Tokyo. The announcement follows weeks of speculation fueled by a couple of London-based job postings. Waymo already has ties to the U.K: In 2019, the company acquired Latent Logic , a U.K. startup spun out of Oxford University’s computer science department that uses a form of machine learning called imitation learning to make self-driving car simulation more realistic. Waymo launched an engineering hub in Oxford as part of the acquisition. In a blog post, Waymo said its all-electric Jaguar I-Pace vehicles — equipped with self-driving technology — will begin driving on London’s public roads in the coming weeks. Waymo will start with human safety drivers behind the wheel before it launches driverless testing and eventually invites the public to hail its robotaxis, a strategy that it has used in other commercial markets such as Phoenix and San Francisco. Waymo wouldn’t provide further details on when it would remove the human safety driver, or the size of the testing fleet. Waymo spokesperson Ethan Teicher did confirm the company intends to operate a self-driving car service for public riders next year. When that robotaxi service launches in 2026 will depend on the U.K. government finalizing its approval process for those operations. Waymo has increasingly tapped partners to share the load of operating a robotaxi service, and similarly plans to use Moove, which already manages its autonomous vehicles (AVs) in Phoenix, to handle fleet operations in London. In Austin and Atlanta, its partner Uber splits the responsibilities of owning and operating a fleet of driverless vehicles, handling the charging, maintenance and cleaning of the AVs, and manages access to the robotaxis via its app. Meanwhile, Waymo monitors the tech and the autonomous operations, including roadside assistance and certain aspects of rider ..."
      },
      {
        "title": "OpenAI has five years to turn $13 billion into $1 trillion",
        "link": "https://techcrunch.com/2025/10/14/openai-has-five-years-to-turn-13-billion-into-1-trillion/",
        "timestamp": "2025-10-15T16:38:27.319624",
        "published": "2025-10-15T05:39:36",
        "summary": "In Brief Posted: 10:39 PM PDT · October 14, 2025 Image Credits: Kim Jae-Hwan/SOPA Images/LightRocket / Getty Images Connie Loizos OpenAI has five years to turn $13 billion into $1 trillion OpenAI is printing money right now. The company is pulling in roughly $13 billion in annual revenue, with 70% coming from everyday people paying $20 a month to chat with an AI, according to the Financial Times . That’s pretty wild when you consider ChatGPT has 800 million regular users, but only 5% are actually paying subscribers. Raking in billions though it may be, OpenAI has also committed to spending over $1 trillion over the next decade (yes, trillion). The company has recently locked in deals for more than 26 gigawatts of computing capacity from Oracle, Nvidia, AMD, and Broadcom — infrastructure that’ll cost vastly more than what’s coming in. To bridge this gap, OpenAI is getting creative, reports the FT. A five-year-plan includes exploring government contracts, shopping tools, video services, consumer hardware, and even becoming a computing supplier itself through its Stargate data center project. A growing number of businesses need to math to work out. Some of America’s most valuable companies are now leaning on OpenAI to fulfill major contracts, notes the FT; if OpenAI falters (no pressure!), it could potentially destabilize the broader U.S. market. Topics AI October 27-29, 2025 San Francisco FLASH SALE ALERT: Register by Oct 17 and save up to $624 (or up to 30% on groups). Get the ticket type for you: Founders: Your next big connection and investor are here . Investors: Meet startups that align with your investment goals. Innovators & Visionaries: See the future of tech before everyone else. S ave Now Newsletters See More Subscribe for the industry’s biggest tech news Related AI Sam Altman says ChatGPT will soon allow erotica for adult users Maxwell Zeff 17 hours ago Commerce You’ll soon be able to shop Walmart from ChatGPT Sarah Perez 22 hours ago Government & Policy Ca..."
      },
      {
        "title": "Coinbase boosts investment in India’s CoinDCX, valuing exchange at $2.45B",
        "link": "https://techcrunch.com/2025/10/14/coinbase-boosts-investment-in-indias-coindcx-valuing-exchange-at-2-45b/",
        "timestamp": "2025-10-15T16:38:27.493747",
        "published": "2025-10-15T04:24:11",
        "summary": "Coinbase's latest investment lifts CoinDCX's valuation from $2.15 billion to $2.45 billion."
      },
      {
        "title": "EVs take a backseat in Stellantis’ $13B US investment plan",
        "link": "https://techcrunch.com/2025/10/14/evs-take-a-backseat-in-stellantis-13b-u-s-investment-plan/",
        "timestamp": "2025-10-15T16:38:27.842930",
        "published": "2025-10-14T22:36:36",
        "summary": "Stellantis, the international automaker that owns Chrysler, Jeep, and Ram, said it will invest $13 billion to beef up its U.S. manufacturing over the next four years as part of a broader revival plan directed by its new CEO. Five new vehicles will be developed and produced through 2029 as part of the investment into factories in Illinois, Ohio, Michigan, and Indiana. The investment will also support the production of a new four-cylinder engine and reopen the Belvidere Assembly Plant in Illinois, which will allow the automaker to expand production of the Jeep Cherokee and Jeep Compass for the U.S. market. In all, more than 5,000 jobs will be created. Unlike previous multibillion-dollar investment pledges, however, this one doesn’t focus on electrification. One of the five new vehicles will be a range-extended EV — a vehicle that combines a battery with a gas generator for additional range — produced at the Warren Truck Assembly Plant in Michigan beginning in 2028. The automaker also plans to produce a large, new, gas-powered SUV at the Warren plant. The remaining products include a next-generation Dodge Durango that will be produced at the Detroit Assembly Complex in 2029, a new midsize truck that will be assembled at its Toledo Assembly Complex in Ohio, and an all-new four-cylinder engine called the GMET4 EVO that will go into production beginning in 2026 at its Kokomo, Indiana, factory. Image Credits: Stellantis Stellantis CEO and North America COO Antonio Filosa said the investment will drive the automaker’s growth, strengthen its manufacturing footprint, and “bring more American jobs to the states we call home.” “Accelerating growth in the U.S. has been a top priority since my first day. Success in America is not just good for Stellantis in the U.S. — it makes us stronger everywhere,” Filosa said in a statement. Techcrunch event DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, Vinod K..."
      },
      {
        "title": "Sam Altman says ChatGPT will soon allow erotica for adult users",
        "link": "https://techcrunch.com/2025/10/14/sam-altman-says-chatgpt-will-soon-allow-erotica-for-adult-users/",
        "timestamp": "2025-10-15T16:38:27.987394",
        "published": "2025-10-14T20:51:51",
        "summary": "OpenAI CEO Sam Altman announced in a post on X Tuesday the company will soon relax some of ChatGPT’s safety restrictions, allowing users to make the chatbot’s responses friendlier or more “human-like,” and for “verified adults” to engage in erotic conversations. “We made ChatGPT pretty restrictive to make sure we were being careful with mental health issues. We realize this made it less useful/enjoyable to many users who had no mental health problems, but given the seriousness of the issue we wanted to get this right,” said Altman. “In December, as we roll out age-gating more fully and as part of our ‘treat adult users like adults’ principle, we will allow even more, like erotica for verified adults.” We made ChatGPT pretty restrictive to make sure we were being careful with mental health issues. We realize this made it less useful/enjoyable to many users who had no mental health problems, but given the seriousness of the issue we wanted to get this right. Now that we have… — Sam Altman (@sama) October 14, 2025 The announcement is a notable pivot from OpenAI’s months-long effort to address the concerning relationships that some mentally unstable users have developed with ChatGPT. Altman seems to declare an early victory over these problems, claiming OpenAI has “been able to mitigate the serious mental health issues” around ChatGPT. However, the company has provided little to no evidence for this, and is now plowing ahead with plans for ChatGPT to engage in sexual chats with users. Several concerning stories emerged this summer around ChatGPT, specifically its GPT-4o model, suggesting the AI chatbot could lead vulnerable users down delusional rabbit holes. In one case, ChatGPT seemed to convince a man he was a math genius who needed to save the world. In another, the parents of a teenager sued OpenAI , alleging ChatGPT encouraged their son’s suicidal ideations in the weeks leading up to his death. In response, OpenAI released a series of safety features to address AI..."
      },
      {
        "title": "At Starbase, SpaceX is taking firefighting into its own hands",
        "link": "https://techcrunch.com/2025/10/14/at-starbase-spacex-is-taking-firefighting-into-its-own-hands/",
        "timestamp": "2025-10-15T16:38:28.255896",
        "published": "2025-10-14T20:39:03",
        "summary": "SpaceX is quietly standing up a volunteer fire department to serve the sprawling launch-and-manufacturing Starbase complex, tightening its control over emergency response at a site known for rapid — and sometimes explosive — rocket development. A certificate of formation filed with the Texas Secretary of State on June 30 shows the creation of what’s called the Starbase Volunteer Fire Department. The nonprofit entity lists its headquarters as 1 Rocket Road in Brownsville, the principal address of SpaceX. Two of the three directors named on the filing are SpaceX employees: Cody Dye, environmental health and safety manager, and Kevin Bagnall, in-house counsel. The certificate is signed by another SpaceX lawyer, Stephen Herndon. The filing says the organization will “aid, promote and provide for the establishment of systems and facilities for the provision of public safety education, and fire prevention and suppression services.” Another new document posted by the city of Starbase late Tuesday confirms the new volunteer fire department was started by SpaceX employees, and that the new municipality plans to sign a contract with it to “provide Fire Protection Services for all persons and property within the city limits.” That agreement will last for three years before it needs to be renewed. SpaceX has historically handled fires at Starbase, which was recently incorporated as its own Texas city, with a combination of an internal firefighting and emergency response team and help from local fire departments, such as the one in nearby Brownsville. It’s unclear what impact the new volunteer fire department will have on those external relationships, and when asked, Cameron County directed TechCrunch to submit a public information act request. At the time of publication, Cameron County had not responded to that request. SpaceX, Brownsville Fire Department, and Starbase city officials did not respond to TechCrunch’s request for comment. Techcrunch event DISRUPT FLASH SALE: Save ..."
      },
      {
        "title": "Inaudible sound might be the next frontier in wildfire defense",
        "link": "https://techcrunch.com/2025/10/14/inaudible-sound-might-be-the-next-frontier-in-wildfire-defense/",
        "timestamp": "2025-10-15T16:38:28.540084",
        "published": "2025-10-14T19:54:34",
        "summary": "A decade ago, two college students built a fire extinguisher that snuffed out a fire using nothing more than a booming 10-inch subwoofer. The internet lapped it up, and Jimmy Fallon even booked a demonstration for “The Tonight Show.” But since that brief viral moment, there hasn’t been much more than a whisper about the technology. It’s not for lack of trying. The college kids weren’t the first to prove the concept. DARPA was on the case in 2012 ; and a search of the scientific literature reveals dozens of researchers investigating the idea. One startup now claims to have cracked the problem. Sonic Fire Tech has built an acoustic fire suppression system that doesn’t just extinguish flames, it might also protect homes and other buildings from wildfires. The startup has raised a $3.5 million seed round from investors, including Khosla Ventures and Third Sphere, TechCrunch has exclusively learned. Wildfires cost the U.S. as much as $424 billion annually . The problem has become so acute in places like California that insurers are refusing to renew policies after repeated blazes have reduced large swathes of the state to ashes. Sonic Fire Tech has been developing its technology over the last several years. Michael Thomas, who is chairman of the startup’s board, had been tinkering with the idea of using sound to fight fires, and when he hit a wall, he reached out to Geoff Bruder over LinkedIn. Bruder had worked for NASA, where he focused on heat and acoustics. “This is kind of a new-age founding story,” Bruder, the startup’s CEO and CTO, told TechCrunch. Techcrunch event DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, Vinod Khosla — some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Grab your ticket before Oct 17 to save up to $624. DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia..."
      },
      {
        "title": "Spotify partners with Netflix for video podcast distribution deal",
        "link": "https://techcrunch.com/2025/10/14/spotifys-video-podcasts-are-coming-to-netflix-next-year/",
        "timestamp": "2025-10-15T16:38:28.761183",
        "published": "2025-10-14T18:00:00",
        "summary": "Spotify is partnering with Netflix to bring select video podcasts to the streaming platform starting in early 2026. The deal will feature curated shows from Spotify Studios and The Ringer, expanding later to include more genres. The move reflects Spotify’s growing focus on video as a key driver for engagement and ad revenue, with video podcast consumption now growing 20 times faster than audio-only content."
      },
      {
        "title": "Impulse Space details plan to deliver up to 6 tons a year to the moon",
        "link": "https://techcrunch.com/2025/10/14/impulse-space-details-plan-to-deliver-up-to-6-tons-a-year-to-the-moon/",
        "timestamp": "2025-10-15T16:38:28.761183",
        "published": "2025-10-14T17:53:47",
        "summary": "Impulse Space laid out an ambitious plan Tuesday to use its tech to haul tons of cargo to the moon as early as 2028, aiming to fill what it sees as a gap in today’s market for mid-sized surface deliveries. The company says it will pair a new lunar lander with its “Helios” high-energy kick stage to move tons to the surface without needing to refuel on orbit. The aim is to deliver up to 6 tons of payload to the moon across two missions “at a cost-effective price point.” The startup, founded by former SpaceX propulsion chief Tom Mueller , argues this capacity would fill a “critical gap” in lunar payload logistics for cargo too big to fit on landers part of NASA’s Commercial Lunar Payload Services program and too small for the forthcoming human-rated landers that are being developed by SpaceX and Blue Origin. Impulse says payloads that hit this mark are roughly 0.5 to 13 tons, a range that could include rovers, habitat modules, power generators, comms systems, or even a lunar terrain vehicle. Under the proposed architecture, the lander and kick stage would launch on a standard rocket where they would be deployed in low Earth orbit. Helios would transport the lander to low lunar orbit within seven days, after which the two vehicles would separate, and the lander would descend to the surface. Impulse is bringing to the table deep expertise in spacecraft engine development; it is already at work on the lunar lander engine, which uses the same fuel combination as the Saiph thrusters used on the company’s small spacecraft Mira. Meanwhile, Helios is “already well into development,” with the first flight scheduled for late 2026. The company estimates it will be flying Helios multiple times per year by 2028. Techcrunch event DISRUPT FLASH SALE: Save up to $624 until Oct 17 Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, Vinod Khosla — some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth an..."
      },
      {
        "title": "Mozilla’s Firefox adds Perplexity’s AI answer engine as a new search option",
        "link": "https://techcrunch.com/2025/10/14/mozillas-firefox-adds-perplexitys-ai-answer-engine-as-a-new-search-option/",
        "timestamp": "2025-10-15T16:38:29.030873",
        "published": "2025-10-14T17:49:21",
        "summary": "While AI companies , startups , and others are rolling out their own web browsers that embed AI services deep into the web surfing experience, Mozilla’s Firefox is instead allowing its customers to swap out their default search engine for an AI-powered search option in the browser they already use. The company on Tuesday announced that it’s bringing AI answer engine Perplexity to Firefox, letting customers decide whether they want to use AI to search the web and find new information. Mozilla had previously announced it was testing the integration, but the option was only available in select markets, including the U.S., U.K., and Germany. It was not yet determined if Perplexity would become a permanent addition to Firefox’s list of web search providers, alongside others like Google, Bing, and DuckDuckGo. Image Credits: Mozilla Now, the company says that positive user feedback has pushed it to make Perplexity available to its global users on the desktop. It will arrive on mobile devices in the months ahead. Once enabled, Perplexity offers a conversational search experience where answers appear with citations, as opposed to a list of web links, as with Google’s traditional search. The option will appear in the unified search button in the address bar, which lets you quickly switch to search with Perplexity as needed. Users can also configure their default search provider in Firefox’s settings. Mozilla had earlier said that if the Perplexity pilot was successful, it would look to add more AI answer engines or search options to its browser in the future. (It likely started with Perplexity because the company says it won’t share or sell users’ personal data.) Alongside news of the AI search option, Mozilla also noted it’s making its browser profiles broadly available to all users after months of tests and a gradual rollout. This feature lets you switch between different browser setups, like those for work, school, or personal use. Image Credits: Mozilla Plus, the company ..."
      },
      {
        "title": "Facebook brings back job listings in the US",
        "link": "https://techcrunch.com/2025/10/14/facebook-brings-back-job-listings-in-the-us/",
        "timestamp": "2025-10-15T16:38:29.316999",
        "published": "2025-10-14T16:31:03",
        "summary": "In Brief Posted: 9:31 AM PDT · October 14, 2025 Image Credits: Facebook Lauren Forristal Facebook brings back job listings in the US Three years after removing its job listings feature, Facebook is bringing it back to users in the U.S., focusing on helping people find local jobs in entry-level, trade, and service sectors. Job listings, available to all users 18 years and older, can be found in a tab within the Marketplace section as well as in Groups and Pages. Users can filter and sort jobs by category, distance, and job type. Facebook also says it will provide tailored recommendations for relevant opportunities based on users’ job browsing history. After submitting their applications, they can chat with companies via Messenger to arrange interviews. Image Credits: Facebook The job listings feature initially launched in 2017 in the U.S. and Canada, and then expanded to over 40 countries a year later. However, in 2022, Facebook limited its support to only the U.S. and Canada, ultimately discontinuing the feature in 2023, likely due to the increasing use of LinkedIn. Meta didn’t explain why it chose to bring back job listings now. However, it seems like it’s trying to go back to its roots and expand its purpose beyond just social networking. Back in January, Meta’s CEO Mark Zuckerberg mentioned wanting to see a “return to OG Facebook” as one of his big goals this year during the Q4 earnings call. This could also be a way for Facebook to appeal to younger people who are just starting out in their careers and to draw in more Gen Z users. Plus, by prioritizing entry-level, trade, and service industry positions, Facebook aims to differentiate itself from LinkedIn, which tends to cater to medium- and high-skilled job roles. Facebook has more than 3 billion monthly active users, while LinkedIn is catching up with over 1 billion users. Topics Apps , Facebook , In Brief , job hunting , job listings October 27-29, 2025 San Francisco FLASH SALE ALERT: Register by Oct 17 and sa..."
      }
    ],
    "scraped_count": 15,
    "format": "rss",
    "feed_title": "TechCrunch"
  },
  {
    "source": "The Verge",
    "type": "tech",
    "priority": 3,
    "items": [
      {
        "title": "Honor’s Robot Phone concept features a fold-out camera arm",
        "link": "https://www.theverge.com/news/799944/honor-robot-phone-tease-announcement",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T14:13:55",
        "summary": "Honor has announced what it’s calling the “Robot Phone,” a concept device with an AI-enabled, gimbal-mounted camera that unfolds from the phone’s rear and can shoot photos and film video in any direction. The phone — so far only seen in CGI form in a teaser video, with no glimpse of real hardware just yet [&#8230;]"
      },
      {
        "title": "Japan wants OpenAI to stop ripping off manga and anime",
        "link": "https://www.theverge.com/news/799938/japan-government-openai-sora",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T14:03:33",
        "summary": "Japan’s government is dialing up the heat on OpenAI, formally asking it to stop ripping off Japanese artwork, according to ITMedia and reported by IGN. The company has been in copyright hell after the launch of its social video app Sora, which users swiftly filled with questionable AI-generated material. Minoru Kiuchi, whose many Japanese ministerial [&#8230;]"
      },
      {
        "title": "Major federation of unions calls for ‘worker-centered AI’ future",
        "link": "https://www.theverge.com/ai-artificial-intelligence/799850/afl-cio-workers-first-initiative-ai",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T14:00:00",
        "summary": "On Wednesday, the largest US group of unions called on employers and policymakers to join in an effort it’s calling the “workers first initiative on AI.” Functionally, the effort by the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) amounts to strengthened collective bargaining in the workplace and advocating for regulations to limit [&#8230;]"
      },
      {
        "title": "Apple’s iPad Pro now has an M5 chip and some nice internal upgrades",
        "link": "https://www.theverge.com/news/799352/apple-ipad-pro-m5-price-release-date",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:03:01",
        "summary": "Apple just announced a new model of its best and highest-end tablet, the iPad Pro. The new device comes with a couple of internal upgrades over the M4-powered model, most notably a brand-new chip, the M5. Apple says the chip brings “up to 3.5x the AI performance” of last year’s Pro, whatever that means, along [&#8230;]"
      },
      {
        "title": "Apple just upgraded the Vision Pro with an M5 chip and new strap",
        "link": "https://www.theverge.com/news/798962/apple-m5-vision-pro-headset-mixed-reality",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:02:30",
        "summary": "Apple just revealed that the Vision Pro headset is getting upgraded to an M5 chip. There’s also a new strap called the Dual Knit Band, which the company says will “help users achieve an even more comfortable fit.” The M5 headsets will be available starting October 22nd for the same $3,499. But aside from the [&#8230;]"
      },
      {
        "title": "Apple’s 14-inch MacBook Pro gets an M5 chip bump and faster storage",
        "link": "https://www.theverge.com/news/797850/apple-macbook-pro-m5-announcement-price-specs",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:01:25",
        "summary": "Apple is refreshing its 14-inch MacBook Pro with a new processor. Announced this morning via press release, the entry-level MacBook Pro now features an M5 chip, faster storage, and a claimed 24 hours of battery life. The rest of the design remains the same, and the price still starts at $1,599 for a 10-core CPU [&#8230;]"
      },
      {
        "title": "Roku’s AI-upgraded voice assistant can answer questions about what you’re watching",
        "link": "https://www.theverge.com/news/799564/roku-voice-assistant-ai-update",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:00:00",
        "summary": "Roku is updating its voice assistant with AI features that can answer questions about movies, shows, and actors, as well as help you find something to watch next. Now, instead of just following simple commands, Roku says its voice assistant can respond to questions like “How scary is The Shining?” or “What kind of fish [&#8230;]"
      },
      {
        "title": "Xbox Ally and Ally X review: this is not an Xbox",
        "link": "https://www.theverge.com/games/799698/xbox-ally-x-review-asus-microsoft-full-screen-experience",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:00:00",
        "summary": "What does \"Xbox\" mean? Some might say it can only refer to a box-shaped Microsoft game machine. Others will argue it's a collection of Xbox-native titles like Halo, Gears, Forza, and Fable. I think most would probably agree it's a game console experience, a way to kick back and easily play the latest games without [&#8230;]"
      },
      {
        "title": "Google will let friends help you recover an account",
        "link": "https://www.theverge.com/news/799780/google-account-recovery-trusted-contacts-mobile-number",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:00:00",
        "summary": "Google is introducing new recovery tools that aim to make it less frustrating to regain access when you’re locked out of your account. Instead of answering security questions or entering a recovery email address, Google’s new security features allow account holders to verify their identity using a linked mobile number, or trusted friends or family [&#8230;]"
      },
      {
        "title": "Honor’s Magic 8 phones have huge batteries and oodles of AI",
        "link": "https://www.theverge.com/news/799808/honor-magic-8-pro-launch-china-specs-release-date",
        "timestamp": "2025-10-15T16:38:26.576685",
        "published": "2025-10-15T13:00:00",
        "summary": "Honor announced its Magic 8 and Magic 8 Pro flagships at a launch event in China today, with an international launch scheduled for later this year. They boast some of the biggest batteries in mainstream phones, along with a suite of AI features including a dedicated AI shortcut button. The version of the Magic 8 [&#8230;]"
      }
    ],
    "scraped_count": 10,
    "format": "rss",
    "feed_title": "The Verge"
  },
  {
    "source": "MIT Technology Review",
    "type": "tech",
    "priority": 3,
    "items": [
      {
        "title": "The Download: Big Tech’s carbon removals plans, and the next wave of nuclear reactors",
        "link": "https://www.technologyreview.com/2025/10/15/1125770/the-download-big-techs-carbon-removals-plans-and-the-next-wave-of-nuclear-reactors/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-15T12:10:00",
        "summary": "This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. Big Tech’s big bet on a controversial carbon removal tactic Microsoft, JP MorganChase, and a tech company consortium that includes Alphabet, Meta, Shopify, and Stripe have all recently struck multimillion-dollar deals to pay&#8230;"
      },
      {
        "title": "Future-proofing business capabilities with AI technologies",
        "link": "https://www.technologyreview.com/2025/10/15/1124329/future-proofing-business-capabilities-with-ai-technologies/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-15T11:07:35",
        "summary": "Artificial intelligence has always promised speed, efficiency, and new ways of solving problems. But what’s changed in the past few years is how quickly those promises are becoming reality. From oil and gas to retail, logistics to law, AI is no longer confined to pilot projects or speculative labs. It is being deployed in critical&#8230;"
      },
      {
        "title": "The quest to find out how our bodies react to extreme temperatures",
        "link": "https://www.technologyreview.com/2025/10/15/1124949/bodies-heat-climate-change-extreme-temperatures/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-15T10:00:00",
        "summary": "It’s the 25th of June and I’m shivering in my lab-issued underwear in Fort Worth, Texas. Libby Cowgill, an anthropologist in a furry parka, has wheeled me and my cot into a metal-walled room set to 40 °F. A loud fan pummels me from above and siphons the dregs of my body heat through the&#8230;"
      },
      {
        "title": "AI is changing how we quantify pain",
        "link": "https://www.technologyreview.com/2025/10/15/1125116/ai-is-changing-how-we-quantify-pain/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-15T10:00:00",
        "summary": "For years at Orchard Care Homes, a 23‑facility dementia-care chain in northern England, Cheryl Baird watched nurses fill out the Abbey Pain Scale, an observational methodology used to evaluate pain in those who can’t communicate verbally. Baird, a former nurse who was then the facility’s director of quality, describes it as “a tick‑box exercise where&#8230;"
      },
      {
        "title": "Big Tech’s big bet on a controversial carbon removal tactic",
        "link": "https://www.technologyreview.com/2025/10/15/1125715/big-techs-big-bet-on-a-controversial-carbon-removal-tactic/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-15T09:00:00",
        "summary": "Over the last century, much of the US pulp and paper industry crowded into the southeastern corner of the nation, setting up mills amid sprawling timber forests to strip the fibers from juvenile loblolly, long leaf, and slash pine trees. Today, after the factories chip the softwood and digest it into pulp, the leftover lignin,&#8230;"
      },
      {
        "title": "The Download: aging clocks, and repairing the internet",
        "link": "https://www.technologyreview.com/2025/10/14/1125672/the-download-aging-clocks-and-repairing-the-internet/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-14T12:10:00",
        "summary": "This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. How aging clocks can help us understand why we age—and if we can reverse it Wrinkles and gray hairs aside, it can be difficult to know how well—or poorly—someone’s body is truly aging.&#8230;"
      },
      {
        "title": "How aging clocks can help us understand why we age—and if we can reverse it",
        "link": "https://www.technologyreview.com/2025/10/14/1124977/aging-clocks-biology-mortality-longevity/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-14T10:00:00",
        "summary": "Be honest: Have you ever looked up someone from your childhood on social media with the sole intention of seeing how they’ve aged?&#160; One of my colleagues, who shall remain nameless, certainly has. He recently shared a photo of a former classmate. “Can you believe we’re the same age?” he asked, with a hint of&#8230;"
      },
      {
        "title": "Can we repair the internet?",
        "link": "https://www.technologyreview.com/2025/10/14/1125104/internet-improvement-book-review-regulation-user-responsibility/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-14T10:00:00",
        "summary": "From addictive algorithms to exploitative apps, data mining to misinformation, the internet today can be a hazardous place. Books by three influential figures—the intellect behind “net neutrality,” a former Meta executive, and the web’s own inventor—propose radical approaches to fixing it. But are these luminaries the right people for the job? Though each shows conviction,&#8230;"
      },
      {
        "title": "Transforming commercial pharma with agentic AI",
        "link": "https://www.technologyreview.com/2025/10/13/1124829/transforming-commercial-pharma-with-agentic-ai/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-13T13:00:00",
        "summary": "Amid the turbulence of the wider global economy in recent years, the pharmaceuticals industry is weathering its own storms. The rising cost of raw materials and supply chain disruptions are squeezing&#160;margins as pharma companies face intense pressure—including from countries like the US—to control drug costs. At the same time, a wave of expiring patents threatens&#8230;"
      },
      {
        "title": "The Download: planet hunting, and India’s e-scooters",
        "link": "https://www.technologyreview.com/2025/10/13/1125657/the-download-planet-hunting-and-indias-e-scooters/",
        "timestamp": "2025-10-15T16:38:26.513329",
        "published": "2025-10-13T12:11:53",
        "summary": "This is today&#8217;s edition of&#160;The Download,&#160;our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. An Earthling’s guide to planet hunting The pendant on Rebecca Jensen-Clem’s necklace is composed of 36 silver hexagons entwined in a honeycomb mosaic. At the Keck Observatory, in Hawaii, just as many segments&#8230;"
      }
    ],
    "scraped_count": 10,
    "format": "rss",
    "feed_title": "MIT Technology Review"
  },
  {
    "source": "Climate Central",
    "type": "climate",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "Climate Central"
  },
  {
    "source": "CleanTechnica",
    "type": "climate",
    "priority": 3,
    "items": [],
    "scraped_count": 0,
    "format": "rss",
    "feed_title": "CleanTechnica"
  },
  {
    "source": "Wired",
    "type": "tech",
    "priority": 3,
    "items": [
      {
        "title": "SteelSeries Arctis Nova 3 Review: The Best Budget Headset",
        "link": "https://www.wired.com/review/steelseries-arctis-nova-3-review/",
        "timestamp": "2025-10-15T16:38:26.861938",
        "published": "2025-10-15T14:33:00",
        "summary": "$110 at Best Buy Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Rating: 9 /10 Open rating explainer Information WIRED Breathable and extremely light. GG app adds real, tangible value. Multi-day battery life. Excellent for mixed audio situations. TIRED Intrusive software affects audio settings on Windows. My office is filled with a variety of gaming headsets, all vying for a spot on my ears. Many sport high-end features, fancy names, and sexy metal headbands, with price tags to match. You can imagine my surprise when the latest from Steelseries, wrapped toe to tip in bright blue plastic and costing just over $100, became my new daily driver. The Steelseries Arctis Nova 3 Wireless are the best gaming headset you can buy at this price for console gaming, and even on PC if you’re willing to cede some control of your audio settings. The next steps up are considerably more expensive, and for most folks won't be worth the extra $100 or more. Gaming, Music, Movies Photograph: Brad Bourque With the standard settings, the Nova 3 aren't terribly impressive. They have a clean, somewhat flat audio profile that does a good job of complementing the lightweight headset. I hope you won’t use them that way, because even just a few minutes in the app will go a long way. Once you've set the equalizer, they start to really shine, with a bigger, more boomy sound that I haven't found on similarly-priced headset. There's an available richness that's really impressive, and you can hear it when you flick the EQ on and off in the app. With the preset profiles applied, games really come to life, with the right pings and pops of action games cutting through, and music in cinematic games swelling dramatically. There are EQ profiles for most games; Anytime I launch a game for the first time, I go into the settings to see if..."
      },
      {
        "title": "Prepaid Phone Plans: Everything You Need to Know About MVNOs",
        "link": "https://www.wired.com/story/prepaid-phone-plans-and-mvnos/",
        "timestamp": "2025-10-15T16:38:27.256426",
        "published": "2025-10-15T13:30:00",
        "summary": "Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. Prepaid phone plans are for more than just setting up a burner phone . Instead of getting locked into a contract and indefinitely paying for a phone you may never actually own, prepaid phone plans promise lower prices while delivering the same coverage and speed as the major networks like AT&T, T-Mobile, and Verizon. What’s not to love? Although prepaid phones sometimes get a bad rap, they make a lot of sense for some customers, particularly if you’re partial to buying unlocked phones and owning them outright. By cutting out contracts that stipulate several lines, financing on phones like the iPhone 17 that can climb well over $1,000, and extras you may not need, like mobile hot spot coverage, prepaid phone services end up much cheaper than major carriers without big performance losses. Still, they aren’t made equally. Most prepaid phone providers tap into an existing cellular network, but they have different limitations on how much access you have to that network. Here's everything you need to know. Check out our other mobile guides, including the Best iPhones , Best Android Phones , Best Cheap Phones , Best Samsung Phones , Best Motorola Phones , and Best Google Pixel Phones . Table of Contents AccordionItemContainerButton LargeChevron What Are Mobile Virtual Network Operators? Downsides of MVNOs and Prepaid Mobile Plans Can You Use the Same Number With a Prepaid Mobile Plan? MVNOs and the Networks They Use Be Choosey With Prepaid Plans (and Even More With MVNOs) What Are Mobile Virtual Network Operators? Photograph: Jacob Roach Prepaid phone plans used to be easy to sort out, but after decades of mergers and acquisitions, the lines have gotten a little messy. The best place to start is the difference between mobile virtu..."
      },
      {
        "title": "ROG Xbox Ally and ROG Xbox Ally X Review: High Performance, High Price",
        "link": "https://www.wired.com/review/review-xbox-rog-ally-and-rog-ally-x/",
        "timestamp": "2025-10-15T16:38:27.795348",
        "published": "2025-10-15T13:00:00",
        "summary": "TriangleUp Buy Now Multiple Buying Options Available $600 at Amazon (Rog Ally) $600 at Asus (ROG Ally) $1,000 at Best Buy (ROG Ally X) $1,000 at Asus (ROG Ally X) Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Rating: 7 /10 Open rating explainer Information WIRED Full 1080p screens with up to 120-Hz refresh rates. Brilliant ergonomics. Extremely versatile. Compatibility with Steam, Epic, and other gaming clients. Cloud gaming works better than ever. TIRED Extremely expensive. Compromised performance on the Ally. Terrible AI “assistant” in Gaming Copilot (but can be turned off). No OLED screens. Cluttered UI. Xbox game library only includes \"Play Anywhere\" titles. A handheld Xbox has been rumored since at least the Xbox 360 era, where gaming forums were rife with speculation that Microsoft was about to face off against Nintendo’s DS and Sony’s PSP. If there was ever anything to the rumor, nothing came of it—until now, 20-odd years later, with Xbox’s first genuine foray into portable gaming . The Redmond giant isn’t diving in solo, though—rather than its own dedicated device, Microsoft has partnered with Asus to deliver two distinct units, the entry-grade ROG Xbox Ally at $600, and the more powerful ROG Xbox Ally X at a somewhat staggering $1,000. These aren’t so much Xbox handhelds as Xbox- branded handhelds, though, adding recognizable iconography onto what might otherwise be the next generation of Asus’ own portables. The team-up delivers top-tier portable play—but a frequently confusing experience. A What Box? It’s best to start with what the X-ROGs—not official terminology, but good shorthand for the pair— aren’t . They’re not Microsoft’s answer to the Nintendo Switch 2 , a bespoke console letting you seamlessly enjoy home-quality gaming on the go. Nor are they a take on the Steam Deck , a ..."
      },
      {
        "title": "4 Best Resume Builders (2025), Tested and Reviewed",
        "link": "https://www.wired.com/gallery/best-resume-builders/",
        "timestamp": "2025-10-15T16:38:28.128753",
        "published": "2025-10-15T12:30:00",
        "summary": "Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. Featured in this article Best Résumé Builder for Most People Resume.io Resume Builder Read more $3 Resume.io (7-day trail) Best Free Résumé Builder FlowCV Resume Builder Read more Shop at FlowCV (Free) Easiest Résumé Builder Zety Resume Builder Read more Shop at Zety (Free) Best AI Résumé Builder Resume Genius Resume Builder Read more Shop at Resume Genius (Free) Landing a new job starts with a slam-dunk CV, but Word or Google Docs will only take you so far. In an era of AI-assisted Application Tracking Systems (ATS) where applicants are rejected before a human ever lays eyes on their work experience, the best résumé builders could help you stand out from the crowd. Yes, they’ll give your résumé a pretty face with unique templates and attention-grabbing fonts, but résumé builders shouldn’t just give you a PDF and send you on your way. A good online résumé builder will give tips and insights into how you can bolster your CV, as well as tools for managing your documents when applying to multiple jobs. I’m (thankfully) not in the job market right now, but it wasn’t long ago that I was searching. I dusted off the résumé I used to land a job here at WIRED as a starting point to see how various online résumé builders thought I could improve. Check out more of our web guides, like the Best Website Builders , Best VPNs , and Best Password Managers . Is It Worth Paying for a Résumé Builder? AccordionItemContainerButton LargeChevron You don't need to pay for a résumé builder. There are loads of free templates online, and for a lot of roles, even a cleanly formatted Google Doc or Word file will get the job done. However, résumé builders are a helpful tool if you want your résumé to really stand out, particularly for highly competitive..."
      },
      {
        "title": "8 Best Pet Cameras (2025), Tested and Reviewed",
        "link": "https://www.wired.com/gallery/best-pet-cameras/",
        "timestamp": "2025-10-15T16:38:28.919702",
        "published": "2025-10-15T11:36:00",
        "summary": "Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. Featured in this article Best Pet Camera Tkenpro 2K Pet Camera Treat Dispenser Read more $100 $70 (30% off) Amazon Best Affordable 360 Rotating Pet Camera Petcube Cam 360 Read more $53 $47 (11% off) Amazon Best Dual Pet Camera Imilab C30 Dual Security Camera Read more $60 $47 (22% off) Amazon Best Pet Camera on Wheels Enabot EBO Air 2 Read more $220 $200 (9% off) Amazon I never knew I needed a pet camera, but now I don't think I can ever go into the office (or on vacation) again without one. A security camera can give you extra peace of mind when you're out, and pet cameras specifically designed for our furry friends combine things like the ability to follow your pet around, engage in play, or dispense kibble for an added bonus. Connected to an app on your phone and with Cloud storage options, these pet cameras—including our top pick, the Tkenpro 2K Pet Camera Treat Dispenser ($70) , and our budget pick Petcube Cam 360 ($35) —ensure you'll never miss a moment in your pet's life when you're away (or home). For more peace of mind while you're away from your pet, be sure to check out our related guides, like the Best Automatic Feeders , Best Cat Water Fountains , Best Automatic Litter Boxes , Best Indoor Security Cameras , and Best Outdoor Security Cameras . Jump to Section AccordionItemContainerButton LargeChevron Compare Our Picks Others Tested How I Tested Is There a Difference Between Security and Pet Cameras? Updated October 2025: We've added the Furbo Mini and Petlibro Scout Smart Camera, retested the Furbo 360 Dog Camera, removed the Petkit Purobot Ultra Automatic Cat Litter Box and Petlibro Granary Smart Camera Feeder, and updated links and prices throughout. Best Pet Camera Photograph: Molly Higgins Amazon Chevron Che..."
      },
      {
        "title": "A New Road Safety Group Targets Self-Driving Cars",
        "link": "https://www.wired.com/story/road-safety-group-save-us-targets-self-driving-cars/",
        "timestamp": "2025-10-15T16:38:29.777326",
        "published": "2025-10-15T11:00:00",
        "summary": "Save Story Save this story Save Story Save this story A new advocacy group is pushing state lawmakers to pass more stringent autonomous vehicle regulations. The group, Safe Autonomous Vehicles Everywhere in the United States (SAVE-US), says its goal is to ensure that new self-driving technology will save lives instead of doing harm. Its work has a clear target: Tesla . The campaign , announced on Wednesday, counts among its goals passing legislation that would require tech developers to be clearer about the limits of their driving technology; report more specific and public crash information to states; and use multiple sensors on their vehicles. In the US, regulations governing autonomous vehicles are generally handled by the states, whose laws range from stringent (California) to relatively permissive (Arizona, Texas). Fourteen US states don’t have autonomous-vehicle-related laws at all. The group will initially target lawmakers in large states, including Illinois, New York, and New Jersey, says Shua Sanchez, the group’s national campaign director. Sanchez and Bob Somers, SAVE-US’s technical adviser, met this summer outside an administrative hearing in Oakland, California. Inside, attorneys for California's Department of Motor Vehicles argued that Tesla should temporarily lose its license to manufacture and sell vehicles in the state because, they alleged, the electric automaker had falsely advertised its Full Self-Driving and Autopilot driver assistance features. Sanchez, a physicist, had been following Tesla closely since he got involved in the Tesla Takedown movement earlier this year, leading demonstrations outside of a showroom in Boston to protest CEO Elon Musk’s involvement with the so-called Department of Government Efficiency . Somers had worked as an engineer at the self-driving vehicle developer Zoox for half a decade. (He’s since left the autonomous vehicle industry.) In Oakland, they agreed: Autonomous vehicle technology has the potential to save lives..."
      },
      {
        "title": "What Is Google One? A Breakdown of Plans, Pricing, and Included Services",
        "link": "https://www.wired.com/story/what-is-google-one/",
        "timestamp": "2025-10-15T16:38:30.108475",
        "published": "2025-10-15T10:30:00",
        "summary": "Save Story Save this story Save Story Save this story All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more. Google One is the company's subscription cloud storage service, with several tiers offered at monthly fees and higher tiers that include the latest Google Gemini artificial intelligence features. Every Google account comes with 15 gigabytes of free cloud storage shared across Google Drive, Google Photos, and Gmail. But with videos of your kids, hi-res photos of your pets, and work files, that space doesn’t stretch far today. Google One storage can be shared with your family, but it’s just the start—there are other benefits to subscribing. If Google’s not for you, there are other cloud storage options . If you want to change your data-hoarding habits , we also have advice on how to stay under your 15 GB allowance . All in on Apple? Read our guide to Apple One . Updated October 2025: We added details of Google’s new subscription tiers and updated the benefits to include recent additions like Google Home Premium. Google One Pricing and Features Courtesy of Simon Hill Courtesy of Simon Hill Google One has five main tiers : Basic Plan (100 GB) : For $2 per month or $20 per year (£1.59 or £16 in the UK), you get 100 gigabytes you can share with up to five family members. Standard Plan (200 GB) : For $3 per month (no annual plan), you get 200 gigabytes you can share with up to five family members. You also get 3 percent back on purchases from the Google Store . Premium Plan (2 TB) : For $10 per month or $100 per year (£8 or £80 in the UK), you get 2 terabytes with family sharing, unlimited Magic Editor saves in Google Photos, 10 percent back on purchases from the Google Store, and Google Workspace premium. AI Pro Plan (2 TB) : For $20 per month (no annual plan; £19 in the UK), you get all the perks of the Premium Plan, but also ac..."
      },
      {
        "title": "When Face Recognition Doesn’t Know Your Face Is a Face",
        "link": "https://www.wired.com/story/when-face-recognition-doesnt-know-your-face-is-a-face/",
        "timestamp": "2025-10-15T16:38:30.561566",
        "published": "2025-10-15T09:30:00",
        "summary": "Save Story Save this story Save Story Save this story Autumn Gardiner thought updating her driving license would be straightforward. After getting married last year, she headed to the local Department of Motor Vehicles office in Connecticut to get her name changed on her license. While she was there, Gardiner recalls, officials said she needed to update her photo. That’s when things started to go wrong. Every time staff tried to take her photo, Gardiner says, the system would reject it. “Everyone's watching. They’re taking more photos,” she recalls. Gardiner, who works as a grant manager for an environmental conservation charity, is one of a small number of people globally who live with Freeman-Sheldon syndrome . Sometimes known as Whistling Face syndrome, the genetic condition impacts muscles around the face and skull, which can result in an undersized mouth. As more staff members at the DMV were called to help, Gardiner says she started to believe the rejected photos were being caused by her facial difference . The camera system didn’t seem to work for her, she says. “It was humiliating and weird. Here’s this machine telling me that I don’t have a human face,” Gardiner says. Gardiner isn’t alone. Around half a dozen people living with a variety of facial differences—from birthmarks to craniofacial conditions—tell WIRED they are increasingly struggling to participate in modern life as identity verification software, which often is powered by machine learning, is quickly becoming commonplace. Courtesy of Rick Guidotti for Positive Exposure Some of those living with facial differences tell WIRED they have undergone multiple surgeries and experienced stigma for their entire lives, which is now being echoed by the technology they are forced to interact with. They say they haven’t been able to access public services due to facial verification services failing, while others have struggled to access financial services. Social media filters and face-unlocking systems on ph..."
      },
      {
        "title": "Waymo's Robotaxis Are Coming to London",
        "link": "https://www.wired.com/story/waymos-robotaxis-are-coming-to-london/",
        "timestamp": "2025-10-15T16:38:30.754217",
        "published": "2025-10-15T09:00:00",
        "summary": "Save Story Save this story Save Story Save this story Waymo is expanding to London, the self-driving vehicle developer announced on Wednesday. The Google sister company aims to start service next year, when the UK government plans to allow autonomous vehicles to begin operating on its roads in limited pilot programs. Waymo says it’s working with the government to receive the necessary permissions for its launch. This is only Waymo ’s second venture outside the United States—though could be its first international robotaxi service. The company has been testing robotaxis in Tokyo since April , where it works with Japanese taxi company Nihon Kotsu, whose drivers are helping Waymo map and collect driving data from the city, and Japanese ride-hail firm GO. But the company won’t say when, or if, it plans to launch autonomous taxis in Japan. London could prove the company’s biggest challenge yet. Unlike more car-oriented cities in the US, London’s streets are more winding and narrow, the city's layout a legacy of its pre-Roman and medieval history. “We will take the same rigorous approach to testing and deploying in London as we have in other cities before offering rides to the public,” Waymo spokesperson Ethan Teicher wrote in an email. He says Waymo’s experience in Tokyo will help its software drive in London. Waymo operates paid taxi service in five US cities: Phoenix, San Francisco, Los Angeles, Austin, and Atlanta. (It operates the latter two services through the Uber app.) It has announced plans to launch in Dallas, Miami, Washington, DC, and Nashville next year. It has also received a permit to test autonomous vehicles in New York City, though must do so with a safety driver behind the wheel. The company says it has provided more than ten million paid rides since it picked up its first customers in 2020. Waymo’s move follows the UK government’s announcement this spring that it would accelerate by more than a year its plans to allow autonomous vehicle tech on public ..."
      },
      {
        "title": "SpaceX’s Second-Gen Starship Signs Off With a Near-Perfect Test Flight",
        "link": "https://www.wired.com/story/spacexs-second-gen-starship-signs-off-with-a-near-perfect-test-flight/",
        "timestamp": "2025-10-15T16:38:31.073915",
        "published": "2025-10-15T07:00:00",
        "summary": "Save Story Save this story Save Story Save this story SpaceX closed a troubled but instructive chapter in its Starship rocket program Monday with a near-perfect test flight that carried the stainless steel spacecraft halfway around the world from South Texas to the Indian Ocean. The rocket’s 33 methane-fueled Raptor engines roared to life at 6:23 pm CDT (7:23 pm EDT; 23:23 UTC), throttling up to generate some 16.7 million pounds of thrust, by a large measure more powerful than any rocket before Starship. Moments later, the 404-foot-tall (123-meter) rocket began a vertical climb away from SpaceX’s test site in Starbase, Texas, near the US-Mexico border. From then on, the rocket executed its flight plan like clockwork. This was arguably SpaceX’s most successful Starship test flight to date. The only flight with a similar claim occurred one year ago Monday, when the company caught the rocket’s Super Heavy booster back at the launch pad after soaring to the uppermost fringes of the atmosphere. But that flight didn’t accomplish as much in space. “Starship’s eleventh flight test reached every objective, providing valuable data as we prepare the next generation of Starship and Super Heavy,” SpaceX posted on X. SpaceX’s 11th Starship flight climbs away from Starbase, Texas. Courtesy of SpaceX SpaceX didn’t try to recover the Super Heavy booster on this flight, but the goals the company set before the launch included an attempt to guide the enormous rocket stage to a precise splashdown in the Gulf of Mexico off the coast of South Texas. The booster, reused from a previous flight in March, also validated a new engine configuration for its landing burn, first reigniting 13 of its engines, then downshifting to five, then to three for the final hover. That all worked, along with pretty much everything else, apart from an indication on SpaceX’s livestream that Starship’s Super Heavy booster stage lost an engine early in its descent. The malfunctioning engine had no impact on the ..."
      }
    ],
    "scraped_count": 10,
    "format": "rss",
    "feed_title": "Feed: All Latest"
  },
  {
    "source": "IEEE Spectrum",
    "type": "tech",
    "priority": 3,
    "items": [
      {
        "title": "Faster, Smaller AI Model Found for Image Geolocation",
        "link": "https://spectrum.ieee.org/where-was-this-photo-taken",
        "timestamp": "2025-10-15T16:38:27.699645",
        "published": "2025-10-15T12:00:03",
        "summary": "Imagine playing a new, slightly altered version of the game GeoGuessr . You’re faced with a photo of an average U.S. house, maybe two floors with a front lawn in a cul-de-sac and an American flag flying proudly out front. But there’s nothing particularly distinctive about this home, nothing to tell you the state it’s in or where the owners are from. You have two tools at your disposal: your brain, and 44,416 low-resolution, bird’s-eye-view photos of random places across the United States and their associated location data. Could you match the house to an aerial image and locate it correctly? I definitely couldn’t, but a new machine learning model likely could. The software, created by researchers at China University of Petroleum (East China) , searches a database of remote sensing photos with associated location information to match the streetside image—of a home or a commercial building or anything else that can be photographed from a road—to an aerial image in the database. While other systems can do the same, this one is pocket-size compared to others and super accurate. At its best (when faced with a picture that has a 180 degree field of view), it succeeds up to 97 percent of the time in the first stage of narrowing down location. That’s better than or within two percentage points of all the other models available for comparison. Even under less-than-ideal conditions, it performs better than many competitors. When pinpointing an exact location, it’s correct 82 percent of the time, which is within three points of the other models. But this model is novel for its speed and memory savings. It is at least twice as fast as similar ones and uses less than a third the memory they require, according to the researchers. The combination makes it valuable for applications in navigation systems and the defense industry. “We train the AI to ignore the superficial differences in perspective and focus on extracting the same ‘key landmarks’ from both views, converting them int..."
      },
      {
        "title": "How Roomba Got Its Vacuum",
        "link": "https://spectrum.ieee.org/irobot-roomba-history",
        "timestamp": "2025-10-15T16:38:28.064322",
        "published": "2025-10-15T12:00:03",
        "summary": "Robotics Feature Consumer Electronics How Roomba Got Its Vacuum Joe Jones describes how the Roomba came to be Joe Jones 2h 9 min read This first-generation iRobot Roomba was signed by the development team. Joe Jones Adapted from Dancing With Roomba , written by Joe Jones , who was iRobot’s first full-time employee and the original designer of the Roomba robot vacuum. After developing a prototype robot that was effective at cleaning both hard floors and carpets using a relatively simple carpet-sweeping mechanism , iRobot vice president Winston Tao and the iRobot marketing team have organized a focus group so that Roomba’s engineers can witness the reaction of potential first customers. One pleasant midsummer day in 2001, Roomba’s engineers, Winston Tao, and several other iRobot folk rendezvoused at an unremarkable, multistory office building on the Cambridge side of the Charles River, across from Boston. We assembled in a narrow room. A long table occupied the room’s center. Snacks and sodas were set out along the back wall; the lighting was subdued. The dominant feature of this cramped chamber was a big one-way mirror occupying almost the entire front wall. Sitting at the table, one could see through the looking glass into a wonderland of market research on the other side. In that much larger, brightly lit room were comfortable chairs, an easel with a large pad of paper, and our hired facilitator. Although this was a familiar trope I’d seen a hundred times on TV, actually lurking in an observation room like this felt a touch surreal. iRobot vs Focus Group We’d paid maybe US $10,000 for the privilege of setting up some focus groups—probably the most the company had ever spent on a market research event. But we needed to know how potential customers would react to our Roomba prototype when they saw one in the (plastic) flesh cleaning the floor at their feet. At the appointed hour, our facilitator welcomed eight to 10 bona fide ordinary people as they filed into the la..."
      },
      {
        "title": "Teaching AI to Predict What Cells Will Look Like Before Running Any Experiments",
        "link": "https://spectrum.ieee.org/genai-morphdiff-drug-discovery",
        "timestamp": "2025-10-15T16:38:28.603409",
        "published": "2025-10-15T11:00:02",
        "summary": "This is a sponsored article brought to you by MBZUAI . If you’ve ever tried to guess how a cell will change shape after a drug or a gene edit, you know it’s part science, part art, and mostly expensive trial-and-error. Imaging thousands of conditions is slow; exploring millions is impossible. A new paper in Nature Communications proposes a different route: simulate those cellular “after” images directly from molecular readouts, so you can preview the morphology before you pick up a pipette. The team calls their model MorphDiff, and it’s a diffusion model guided by the transcriptome, the pattern of genes turned up or down after a perturbation. At a high level, the idea flips a familiar workflow. High-throughput imaging is a proven way to discover a compound’s mechanism or spot bioactivity but profiling every candidate drug or CRISPR target isn’t feasible. MorphDiff learns from cases where both gene expression and cell morphology are known, then uses only the L1000 gene expression profile as a condition to generate realistic post-perturbation images, either from scratch or by transforming a control image into its perturbed counterpart. The claim is that competitive fidelity on held-out (unseen) perturbations across large drug and genetic datasets plus gains on mechanism-of-action (MOA) retrieval can rival real images. aspect_ratio This research led by MBZUAI researchers starts from a biological observation: gene expression ultimately drives proteins and pathways that shape what a cell looks like under the microscope. The mapping isn’t one-to-one, but there’s enough shared signal for learning. Conditioning on the transcriptome offers a practical bonus too: there’s simply far more publicly accessible L1000 data than paired morphology, making it easier to cover a wide swath of perturbation space. In other words, when a new compound arrives, you’re likely to find its gene signature which MorphDiff can then leverage. Under the hood, MorphDiff blends two pieces. First, a Mo..."
      },
      {
        "title": "Nokia Bell Labs Breaks Ground for Its New N.J. Headquarters",
        "link": "https://spectrum.ieee.org/nokia-bell-labs-new-headquarters",
        "timestamp": "2025-10-15T16:38:29.094724",
        "published": "2025-10-14T18:00:03",
        "summary": "IEEE Spectrum FOR THE TECHNOLOGY INSIDER Topics Aerospace AI Biomedical Climate Tech Computing Consumer Electronics Energy History of Technology Robotics Semiconductors Telecommunications Transportation Sections Features News Opinion Careers DIY Engineering Resources More Newsletters Special Reports Collections Explainers Top Programming Languages Robots Guide ↗ IEEE Job Site ↗ For IEEE Members Current Issue Magazine Archive The Institute The Institute Archive For IEEE Members Current Issue Magazine Archive The Institute The Institute Archive IEEE Spectrum About Us Contact Us Reprints & Permissions ↗ Advertising ↗ Follow IEEE Spectrum Support IEEE Spectrum IEEE Spectrum is the flagship publication of the IEEE — the world’s largest professional organization devoted to engineering and applied sciences. Our articles, videos, and infographics inform our readers about developments in technology, engineering, and science. Subscribe About IEEE Contact & Support Accessibility Nondiscrimination Policy Terms IEEE Privacy Policy Cookie Preferences Ad Privacy Options © Copyright 2025 IEEE — All rights reserved. A public charity, IEEE is the world's largest technical professional organization dedicated to advancing technology for the benefit of humanity."
      },
      {
        "title": "Next-Gen AI Needs Liquid Cooling",
        "link": "https://spectrum.ieee.org/data-center-liquid-cooling",
        "timestamp": "2025-10-15T16:38:29.501864",
        "published": "2025-10-13T15:00:03",
        "summary": "Computing Magazine Feature Next-Gen AI Needs Liquid Cooling Here are four new ways to get it done Dina Genkina 13 Oct 2025 11 min read Vertical In two-phase immersion cooling, a server is dunked into a vat of liquid. The liquid actively boils next to the heat-producing components, cooling them in the process. Chemours DarkBlue1 Walk into a typical data center and one of the first things that jumps out at you is the noise—the low, buzzing sound of thousands of fans: fans next to individual computer chips , fans on the back panels of server racks, fans on the network switches. All of those fans are pushing hot air away from the temperature-sensitive computer chips and toward air-conditioning units. But those fans, whirr as they might, are no longer cutting it. Over the past decade, the power density of the most advanced computer chips has exploded. In 2017, Nvidia came out with the V100 GPU, which draws 300 watts of power. Most of that power dissipates back out as heat. Three years later, in 2020, Nvidia’s A100 came out, drawing up to 400 W. The now-popular H100 arrived in 2022 and consumes up to 700 W. The newest Blackwell GPUs , revealed in 2024, consume up to 1,200 W. “Road maps are looking at over 2,000 watts [per chip] over the next year or two,” says Drew Matter , president and CEO of the liquid-cooling company Mikros Technologies . “In fact, the industry is preparing for 5-kilowatt chips and above in the foreseeable future.” This power explosion is driven by the obvious culprit—AI. And all the extra computations consuming all that added power from advanced chips are generating unmanageable amounts of heat. “The average power density in a rack was around 8 kW,” says Josh Claman , CEO of the startup Accelsius . “For AI, that’s growing to 100 kW per rack. That’s an order of magnitude. It’s really AI adoption that’s creating this real urgency” to figure out a better way to cool data centers . Specifically, the urgency is to move away from fans and toward some sort ..."
      },
      {
        "title": "In a First, Artificial Neurons Talk Directly to Living Cells",
        "link": "https://spectrum.ieee.org/artificial-neuron",
        "timestamp": "2025-10-15T16:38:30.045773",
        "published": "2025-10-13T14:00:04",
        "summary": "The bacteria Geobacter sulfurreducens came from humble beginnings; it was first isolated from dirt in a ditch in Norman, Okla . But now, the surprisingly remarkable microbes are the key to the first ever artificial neurons that can directly interact with living cells . The G. sulfurreducens microbes communicate with one another through tiny, protein-based wires that researchers at the University of Massachusetts Amherst harvested and used to make artificial neurons. These neurons can, for the first time, process information from living cells without an intermediary device amplifying or modulating the signals, the researchers say. While some artificial neurons already exist , they require electronic amplification to sense the signals our bodies produce, explains Jun Yao , who works on bioelectronics and nanoelectronics at UMass Amherst. The amplification inflates both power usage and circuit complexity, and so counters efficiencies found in the brain. The neuron created by Yao’s team can understand the body’s signals at their natural amplitude of around 0.1 volts. This is “highly novel,” says Bozhi Tian , a biophysicist who studies living bioelectronics at the University of Chicago and was not involved in the work. This work “bridges the long-standing gap between electronic and biological signaling” and demonstrates interaction between artificial neurons and living cells that Tian calls “unprecedented.” Real neurons and artificial neurons Biological neurons are the fundamental building blocks of the brain. If external stimuli are strong enough, charge builds up in a neuron, triggering an action potential, a spike of voltage that travels down the neuron’s body to enable all types of bodily functions, including emotion and movement. Scientists have been working to engineer a synthetic neuron for decades, chasing after the efficiency of the human brain , which has so far seemed to escape the abilities of electronics. Yao’s group has designed new artificial neurons that ..."
      },
      {
        "title": "Solid-State Transformer Design Unlocks Faster EV Charging",
        "link": "https://spectrum.ieee.org/ev-charging-solid-state-transformers",
        "timestamp": "2025-10-15T16:38:30.419250",
        "published": "2025-10-11T13:00:03",
        "summary": "This article is part of our exclusive IEEE Journal Watch series in partnership with IEEE Xplore. The rapid build-out of fast-charging stations for electric vehicles is testing the limits of today’s power grid . With individual chargers drawing 350 to 500 kilowatts ( or more )—which makes EV charging times now functionally equivalent to the fill-up time for a gasoline or diesel vehicle—full charging sites can reach megawatt-scale demand. That’s enough to strain medium-voltage distribution networks —the segment of the grid that links high-voltage transmission lines with the low-voltage lines that serve end users in homes and businesses. DC fast-charging stations tend to be clustered in urban centers, along highways, and in fleet depots. Because the load is not spread evenly across the network, particular substations are overworked—even when overall grid capacity is rated to accommodate the load. Overcoming this problem, as more charging stations , with greater power demands, come online requires power electronics that are not only compact and efficient but also capable of managing local storage and renewable inputs. Solid-State Transformers in EV Charging One of the most promising technologies for modernizing the grid so it can keep up with the demands of vehicle electrification and renewable generation is the solid-state transformer (SST). An SST performs the same basic function as a conventional transformer—stepping voltage up or down. But it does so using semiconductors , high-frequency conversion with silicon carbide or gallium nitride switches, and digital control, instead of passive magnetic coupling alone. An SST’s setup allows it to control power flow dynamically. For decades, charging infrastructure has relied on line-frequency transformers (LFTs)—massive assemblies of iron and copper that step down medium-voltage AC to low-voltage AC before or after external conversion from alternating current to the direct current that EV batteries require. A typical LFT ca..."
      },
      {
        "title": "Video Friday: Non-Humanoid Hands for Humanoid Robots",
        "link": "https://spectrum.ieee.org/video-friday-robotic-hands-2674168909",
        "timestamp": "2025-10-15T16:38:30.680640",
        "published": "2025-10-10T16:00:04",
        "summary": "Video Friday is your weekly selection of awesome robotics videos, collected by your friends at IEEE Spectrum robotics. We also post a weekly calendar of upcoming robotics events for the next few months. Please send us your events for inclusion. World Robot Summit : 10–12 October 2025, OSAKA , JAPAN IROS 2025 : 19–25 October 2025, HANGZHOU, CHINA Enjoy today’s videos! There are two things that I really appreciate about this video on grippers from Boston Dynamics . First, building a gripper while keeping in mind that the robot will inevitably fall onto it, because I’m seeing lots of very delicate-looking five-fingered hands on humanoids, and I’m very skeptical of their ruggedness. And second, understanding that not only is a five-fingered hand very likely unnecessary for the vast majority of tasks, but also robot hands don’t have to be constrained by a human hand’s range of motion. [ Boston Dynamics ] Yes, okay, it’s a fancy-looking robot, but I’m still stuck on what useful, practical things can it reliably and cost-effectively and safely DO? - YouTube youtu.be [ Figure ] Life on Earth has evolved in constant relation to gravity , yet we rarely consider how deeply it shapes living systems until we imagine a place without it. In MycoGravity, pink oyster mushrooms grow inside a custom-built bioreactor mounted on a KUKA robotic arm . Inspired by NASA’s random positioning machines, the robot’s programmed movement simulates altered gravity. Over time, sculptural mushrooms emerge, shaped by their environment without a stable gravitational direction. [ MycoGravity ] A new technological advancement gives robotic systems a natural sense of touch without extra skins or sensors. With advanced force sensing and deep learning , this robot can feel where you touch, recognize symbols, and even use virtual buttons—paving the way for more natural and flexible human-robot interaction. [ Science Robotics ] Thanks, Maged! The creator of Mini Pupper introduces HeySanta , which can be your..."
      }
    ],
    "scraped_count": 8,
    "format": "rss",
    "feed_title": "IEEE Spectrum"
  },
  {
    "source": "Reuters World News",
    "type": "news",
    "items": [],
    "error": "Failed to fetch RSS feed"
  },
  {
    "source": "Associated Press",
    "type": "news",
    "items": [],
    "error": "Failed to fetch RSS feed"
  }
]